[
    {
      "arabicText": "رَبِّ اِنِّىْٓ اَعُوْذُ بِكَ اَنْ اَسْـــَٔـلَكَ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ ۭ وَاِلَّا تَغْفِرْ لِيْ وَتَرْحَمْنِيْٓ اَكُنْ مِّنَ الْخٰسِرِيْنَ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-07 21:37:16.226Z",
      "englishTranslation": "O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have Mercy on me, I would indeed be one of the losers.",
      "germanTranslation": "O mein Herr! Ich suche Zuflucht bei Dir, um Dich nicht um etwas zu bitten, wovon ich kein Wissen habe. Und wenn Du mir nicht vergibst und Dich meiner erbarmst, werde ich wahrlich zu den Verlierern gehören.",
      "id": "i4x2mybf9w2c72w",
      "source": "Surah Hud - 11:47",
      "transliteration": "Rabbi Inneee A-o’od’u Bika An As-alaka Maa Laysa Lee Bihee I’lm Wa Illaa Taghfirlee Wa Tarh’amneee Akum Minal Khaasireen",
      "turkishTranslation": "Ey Rabbim! Bilgim olmayan bir şeyi Senden istemekten Sana sığınırım. Eğer beni bağışlamaz ve bana merhamet etmezsen, şüphesiz ki kaybedenlerden olurum.",
      "updated": "2025-05-07 21:37:16.226Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ.",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:10:52.784Z",
      "englishTranslation": "O Allah, You are my Lord, none has the right to be worshipped except You. You created me and I am Your servant, and I abide to Your covenant and promise as best I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favour upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You.",
      "germanTranslation": "O Allah, Du bist mein Herr, es gibt keinen Gott außer Dir. Du hast mich erschaffen und ich bin Dein Diener, und ich halte mich so gut ich kann an Deinen Bund und Dein Versprechen. Ich suche Zuflucht bei Dir vor dem Bösen dessen, was ich getan habe. Ich erkenne Deine Gunst an mir an und ich erkenne meine Sünde an, so vergib mir, denn wahrlich, niemand kann Sünden vergeben außer Dir.",
      "id": "a88j5l07en00dvb",
      "source": "Sahih al-Bukhari 6306",
      "transliteration": "Allahumma anta rabbi la ilaha illa anta, khalaqtani wa ana abduka, wa ana 'ala 'ahdika wa wa'dika ma istata'tu, a'udhu bika min sharri ma sana'tu, aboo'u laka bini'matika 'alayya, wa aboo'u laka bidhanbi faghfir li fa innahu la yaghfiru adhdhunuba illa anta.",
      "turkishTranslation": "Allah'ım! Sen benim Rabbimsin. Senden başka ilah yoktur. Beni Sen yarattın ve ben Senin kulunum. Gücüm yettiğince Senin ahdine ve vaadine sadık kalıyorum. Yaptığım kötülüklerden Sana sığınıyorum. Üzerimdeki nimetini kabul ediyorum ve günahımı itiraf ediyorum. Beni bağışla, çünkü günahları ancak Sen bağışlarsın.",
      "updated": "2025-05-08 18:10:52.784Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:10:52.795Z",
      "englishTranslation": "O Allah, I have greatly wronged myself, and none forgives sins but You. So forgive me with forgiveness from You, and have mercy on me. Indeed, You are the Forgiving, the Merciful.",
      "germanTranslation": "O Allah, ich habe mir selbst großes Unrecht zugefügt, und niemand vergibt Sünden außer Dir. So vergib mir mit Deiner Vergebung und erbarme Dich meiner. Wahrlich, Du bist der Vergebende, der Barmherzige.",
      "id": "e066ax8es5g0080",
      "source": "Sahih al-Bukhari 834",
      "transliteration": "Allahumma inni zalamtu nafsi zulman kathiran, wa la yaghfiru adhdhunuba illa anta, faghfir li maghfiratan min 'indika, warhamni, innaka anta al-Ghafooru ar-Raheem.",
      "turkishTranslation": "Allah'ım! Ben nefsime çok zulmettim ve günahları ancak Sen bağışlarsın. O halde beni bağışla ve bana merhamet et. Şüphesiz Sen, çok bağışlayan ve çok merhamet edensin.",
      "updated": "2025-05-08 18:10:52.795Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُورُ.",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:10:52.801Z",
      "englishTranslation": "My Lord, forgive me and accept my repentance. Indeed, You are the Accepter of Repentance, the Most Forgiving.",
      "germanTranslation": "Mein Herr, vergib mir und nimm meine Reue an. Wahrlich, Du bist der Reue-Annehmende, der Allvergebende.",
      "id": "400tvv2zhdp8elv",
      "source": "At-Tirmidhi 3434",
      "transliteration": "Rabbi ighfir li wa tub 'alayya, innaka anta at-Tawwabu al-Ghafoor.",
      "turkishTranslation": "Rabbim! Beni bağışla ve tövbemi kabul et. Şüphesiz Sen, tövbeleri kabul eden ve çok bağışlayansın.",
      "updated": "2025-05-08 18:10:52.801Z"
    },
    {
      "arabicText": "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا، وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا، لَنَكُونَنَّ مِنَ الْخَاسِرِينَ.",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:10:52.803Z",
      "englishTranslation": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
      "germanTranslation": "Unser Herr, wir haben uns selbst Unrecht zugefügt, und wenn Du uns nicht vergibst und Dich unser nicht erbarmst, werden wir gewiss zu den Verlierern gehören.",
      "id": "84q268zdnk6vo64",
      "source": "Qur'an 7:23",
      "transliteration": "Rabbana zalamna anfusana, wa in lam taghfir lana wa tarhamna, lanakoonanna mina al-khasireen.",
      "turkishTranslation": "Rabbimiz! Biz kendimize zulmettik. Eğer bizi bağışlamaz ve bize merhamet etmezsen, kesinlikle kaybedenlerden oluruz.",
      "updated": "2025-05-08 18:10:52.803Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلَانِيَتَهُ وَسِرَّهُ.",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:10:52.807Z",
      "englishTranslation": "O Allah, forgive me all my sins, the minor and the major, the first and the last, the apparent and the hidden.",
      "germanTranslation": "O Allah, vergib mir all meine Sünden, die kleinen und die großen, die ersten und die letzten, die offensichtlichen und die verborgenen.",
      "id": "6t4d9qwmpl9hhws",
      "source": "Sunan Abu Dawud 878",
      "transliteration": "Allahumma ighfir li dhanbi kullahu, diqqahu wa jillahu, wa awwalahu wa akhirahu, wa 'alaniyatahu wa sirrahu.",
      "turkishTranslation": "Allah'ım! Bütün günahlarımı, küçüğünü ve büyüğünü, ilkini ve sonunu, gizlisini ve açığını bağışla.",
      "updated": "2025-05-08 18:10:52.807Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ.",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:10:52.809Z",
      "englishTranslation": "O Allah, I seek refuge in Your pleasure from Your anger, and in Your forgiveness from Your punishment. I seek refuge in You from You. I cannot enumerate Your praise; You are as You have praised Yourself.",
      "germanTranslation": "O Allah, ich suche Zuflucht in Deinem Wohlgefallen vor Deinem Zorn und in Deiner Vergebung vor Deiner Strafe. Ich suche Zuflucht bei Dir vor Dir. Ich kann Dein Lob nicht aufzählen; Du bist, wie Du Dich selbst gelobt hast.",
      "id": "71m3nl63708jn5b",
      "source": "Sunan Abu Dawud 879",
      "transliteration": "Allahumma inni a'udhu biridaka min sakhatika, wa bimu'afatika min 'uqubatika, wa a'udhu bika minka. La uhsi thana'an 'alayka, anta kama athnayta 'ala nafsik.",
      "turkishTranslation": "Allah'ım! Senin rızana, gazabından; affına, azabından sığınırım. Senden Sana sığınırım. Seni övgüyle anmakta acizim; Sen, kendini övdüğün gibisin.",
      "updated": "2025-05-08 18:10:52.809Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ لِذَنْبِي وَأَسْأَلُكَ رَحْمَتَكَ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.837Z",
      "englishTranslation": "O Allah, I ask You for forgiveness for my sin and I ask You for Your mercy.",
      "germanTranslation": "O Allah, ich bitte Dich um Vergebung für meine Sünde und ich bitte Dich um Deine Barmherzigkeit.",
      "id": "q61b68q2actqz30",
      "source": "Sunan Abi Dawud 1516",
      "transliteration": "Allahumma inni astaghfiruka lidhanbi wa as'aluka rahmatak.",
      "turkishTranslation": "Allah'ım! Günahım için Senden bağışlanma diliyorum ve rahmetini istiyorum.",
      "updated": "2025-05-08 18:15:00.837Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَارْحَمْنِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.843Z",
      "englishTranslation": "My Lord, forgive me, have mercy on me, and accept my repentance. Indeed, You are the Accepter of repentance, the Merciful.",
      "germanTranslation": "Mein Herr, vergib mir, erbarme Dich meiner und nimm meine Reue an. Wahrlich, Du bist der Reue-Annehmende, der Barmherzige.",
      "id": "5rwzox093mbm29x",
      "source": "Sunan Ibn Majah 3835",
      "transliteration": "Rabbi ighfir li warhamni watub 'alayya innaka anta at-Tawwabu ar-Raheem.",
      "turkishTranslation": "Rabbim! Beni bağışla, bana merhamet et ve tövbemi kabul et. Şüphesiz Sen, tövbeleri kabul eden ve merhametli olansın.",
      "updated": "2025-05-08 18:15:00.843Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي وَاهْدِنِي وَارْزُقْنِي",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.849Z",
      "englishTranslation": "O Allah, forgive me, guide me, and provide for me.",
      "germanTranslation": "O Allah, vergib mir, leite mich und versorge mich.",
      "id": "uj02m57fb8wqp9w",
      "source": "Sahih Muslim 2697",
      "transliteration": "Allahumma ighfir li wahdini warzuqni.",
      "turkishTranslation": "Allah'ım! Beni bağışla, bana hidayet ver ve beni rızıklandır.",
      "updated": "2025-05-08 18:15:00.849Z"
    },
    {
      "arabicText": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.853Z",
      "englishTranslation": "Our Lord, forgive us and our brothers who preceded us in faith.",
      "germanTranslation": "Unser Herr, vergib uns und unseren Brüdern, die uns im Glauben vorausgegangen sind.",
      "id": "zpgkd600eh15l2q",
      "source": "Qur'an 59:10",
      "transliteration": "Rabbana ighfir lana wali-ikhwanina alladhina sabaquna bil-eemaan.",
      "turkishTranslation": "Rabbimiz! Bizi ve bizden önce iman etmiş kardeşlerimizi bağışla.",
      "updated": "2025-05-08 18:15:00.853Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.858Z",
      "englishTranslation": "O Allah, forgive me my errors, my ignorance, and my excesses in my affairs.",
      "germanTranslation": "O Allah, vergib mir meine Fehler, meine Unwissenheit und meine Ausschweifungen in meinen Angelegenheiten.",
      "id": "s3n21vf79a50jgv",
      "source": "Sahih Muslim 2719",
      "transliteration": "Allahumma ighfir li khati'ati wa jahli wa israfi fi amri.",
      "turkishTranslation": "Allah'ım! Hatalarımı, cehaletimi ve işlerimdeki aşırılıklarımı bağışla.",
      "updated": "2025-05-08 18:15:00.858Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.863Z",
      "englishTranslation": "My Lord, forgive me, my parents, and the believers on the Day the account is established.",
      "germanTranslation": "Mein Herr, vergib mir, meinen Eltern und den Gläubigen am Tag der Abrechnung.",
      "id": "j5nm76c6s6040kw",
      "source": "Qur'an 14:41",
      "transliteration": "Rabbi ighfir li waliwalidayya walilmu'mineena yawma yaqoomu al-hisaab.",
      "turkishTranslation": "Rabbim! Beni, anne-babamı ve hesap gününde müminleri bağışla.",
      "updated": "2025-05-08 18:15:00.862Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِي رِزْقِي",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.869Z",
      "englishTranslation": "O Allah, forgive me my sin, expand for me my home, and bless me in my provision.",
      "germanTranslation": "O Allah, vergib mir meine Sünde, erweitere mein Zuhause und segne meinen Lebensunterhalt.",
      "id": "f9sg3p2tcmbkzv1",
      "source": "Sunan Ibn Majah 925",
      "transliteration": "Allahumma ighfir li dhanbi, wa wassi' li fi dari, wa barik li fi rizqi.",
      "turkishTranslation": "Allah'ım! Günahımı bağışla, evimi genişlet ve rızkımı bereketlendir.",
      "updated": "2025-05-08 18:15:00.869Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.873Z",
      "englishTranslation": "O Allah, forgive me for what I have done earlier and later, what I have done secretly and openly.",
      "germanTranslation": "O Allah, vergib mir, was ich früher und später getan habe, was ich im Verborgenen und offen getan habe.",
      "id": "60h86nar31436fp",
      "source": "Sahih Muslim 2719",
      "transliteration": "Allahumma ighfir li ma qaddamtu wa ma akhkhartu wa ma asrartu wa ma a'lantu.",
      "turkishTranslation": "Allah'ım! Önceden ve sonradan yaptıklarımı, gizli ve açık işlediğim günahları bağışla.",
      "updated": "2025-05-08 18:15:00.873Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.876Z",
      "englishTranslation": "My Lord, forgive me, my parents, and whoever enters my house a believer.",
      "germanTranslation": "Mein Herr, vergib mir, meinen Eltern und jedem Gläubigen, der mein Haus betritt.",
      "id": "bxn8r5z5e718o43",
      "source": "Qur'an 71:28",
      "transliteration": "Rabbi ighfir li waliwalidayya waliman dakhala baytiya mu'minan.",
      "turkishTranslation": "Rabbim! Beni, anne-babamı ve evime mümin olarak girenleri bağışla.",
      "updated": "2025-05-08 18:15:00.876Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاجْبُرْنِي وَاهْدِنِي وَارْزُقْنِي",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:15:00.880Z",
      "englishTranslation": "O Allah, forgive me, have mercy on me, strengthen me, guide me, and provide for me.",
      "germanTranslation": "O Allah, vergib mir, erbarme Dich meiner, stärke mich, leite mich und versorge mich.",
      "id": "u4jfj5g4sh4yds9",
      "source": "Sahih Muslim 2697",
      "transliteration": "Allahumma ighfir li warhamni wajburni wahdini warzuqni.",
      "turkishTranslation": "Allah'ım! Beni bağışla, bana merhamet et, beni güçlendir, bana hidayet ver ve beni rızıklandır.",
      "updated": "2025-05-08 18:15:00.880Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي ۖ إِنَّكَ أَنْتَ الْوَهَّابُ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:21:30.550Z",
      "englishTranslation": "My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.",
      "germanTranslation": "Mein Herr, vergib mir und gewähre mir ein Königreich, wie es niemandem nach mir zustehen wird. Wahrlich, Du bist der Großzügige.",
      "id": "v7h61181zk8ry30",
      "source": "Qur'an 38:35",
      "transliteration": "Rabbi ighfir li wahab li mulkan la yanbaghi li ahadin min ba'di, innaka anta al-Wahhab.",
      "turkishTranslation": "Rabbim! Beni bağışla ve benden sonra kimseye nasip olmayacak bir mülk ver. Şüphesiz Sen, çok bağışta bulunansın.",
      "updated": "2025-05-08 18:21:30.550Z"
    },
    {
      "arabicText": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.133Z",
      "englishTranslation": "Glory be to Allah and praise Him. I seek forgiveness from Allah and repent to Him.",
      "germanTranslation": "Preis sei Allah und Lob sei Ihm. Ich suche Vergebung bei Allah und bereue vor Ihm.",
      "id": "3wz2v4n88k05310",
      "source": "Sahih Muslim 2704",
      "transliteration": "SubhanAllahi wa bihamdihi, astaghfirullah wa atubu ilayh",
      "turkishTranslation": "Allah'ı hamd ile tesbih ederim. Allah'tan bağışlanma diler ve O'na tövbe ederim.",
      "updated": "2025-05-08 18:30:18.133Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ الْمَنَّانُ يَا بَدِيعَ السَّمَاوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ اغْفِرْ لِي ذُنُوبِي",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.144Z",
      "englishTranslation": "O Allah, I ask You by virtue of the fact that all praise is Yours; there is none worthy of worship but You alone, with no partner; the Bestower of favors, O Originator of the heavens and earth, O Possessor of majesty and honor, O Ever-Living, O Self-Sustaining, forgive my sins.",
      "germanTranslation": "O Allah, ich bitte Dich aufgrund der Tatsache, dass alles Lob Dir gehört; es gibt keinen Anbetungswürdigen außer Dir allein, ohne Partner; der Gewährer von Gunstbezeigungen, O Schöpfer der Himmel und der Erde, O Besitzer von Majestät und Ehre, O Ewiglebende, O Selbst-Erhaltende, vergib meine Sünden.",
      "id": "xe8533s5wgt1h22",
      "source": "Sunan an-Nasa'i 1301",
      "transliteration": "Allahumma inni as'aluka bi-anna lakal-hamd, la ilaha illa ant, wahdaka la sharika lak, al-Mannan, ya Badi'as-samawati wal-ard, ya Dhal-jalali wal-ikram, ya Hayyu ya Qayyum, ighfir li dhunubi",
      "turkishTranslation": "Allah'ım! Hamdin yalnızca Sana mahsus olduğu, Senden başka ilah olmadığı, ortağın bulunmadığı, nimetler veren, göklerin ve yerin yaratıcısı, celal ve ikram sahibi, hayy ve kayyum olan Senin hakkın için günahlarımı bağışla.",
      "updated": "2025-05-08 18:30:18.144Z"
    },
    {
      "arabicText": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.152Z",
      "englishTranslation": "Our Lord, do not hold us accountable if we forget or make a mistake.",
      "germanTranslation": "Unser Herr, halte uns nicht zur Rechenschaft, wenn wir vergessen oder einen Fehler machen.",
      "id": "qy9k2nq78hyxwpq",
      "source": "Qur'an 2:286",
      "transliteration": "Rabbana la tu'akhidhna in nasina aw akhta'na",
      "turkishTranslation": "Rabbimiz! Unuttuk veya yanıldıysak bizi hesaba çekme.",
      "updated": "2025-05-08 18:30:18.152Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْتَ أَنْتَ رَبِّي وَأَنَا عَبْدُكَ ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.156Z",
      "englishTranslation": "O Allah, You are the Sovereign, there is none worthy of worship but You. You are my Lord and I am Your servant. I have wronged myself and I acknowledge my sin, so forgive all my sins, for none forgives sins but You.",
      "germanTranslation": "O Allah, Du bist der Souverän, es gibt keinen Anbetungswürdigen außer Dir. Du bist mein Herr und ich bin Dein Diener. Ich habe mir selbst Unrecht getan und ich gestehe meine Sünde, also vergib mir all meine Sünden, denn niemand vergibt Sünden außer Dir.",
      "id": "sbpt0s153313473",
      "source": "Sunan at-Tirmidhi 3430",
      "transliteration": "Allahumma antal-Malik, la ilaha illa ant, anta Rabbi wa ana 'abduk, zalamtu nafsi wa'taraftu bidhanbi, faghfir li dhunubi jami'an, innahu la yaghfirudh-dhunuba illa ant",
      "turkishTranslation": "Allah'ım! Sen Melik'sin, Senden başka ilah yoktur. Sen benim Rabbimsin, ben de Senin kulunum. Kendime zulmettim ve günahımı itiraf ediyorum. Bütün günahlarımı bağışla, çünkü günahları ancak Sen bağışlarsın.",
      "updated": "2025-05-08 18:30:18.156Z"
    },
    {
      "arabicText": "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.159Z",
      "englishTranslation": "I seek forgiveness from Allah the Almighty, besides Whom there is none worthy of worship, the Ever-Living, the Self-Sustaining, and I repent to Him.",
      "germanTranslation": "Ich suche Vergebung bei Allah, dem Allmächtigen, neben Dem es keinen Anbetungswürdigen gibt, dem Ewiglebenden, dem Selbst-Erhaltenden, und ich bereue vor Ihm.",
      "id": "b4v6891311d918l",
      "source": "Sunan Abu Dawud 1517",
      "transliteration": "Astaghfirullahal-'Adheem alladhi la ilaha illa Huwal-Hayyul-Qayyum wa atubu ilayh",
      "turkishTranslation": "Kendisinden başka ilah olmayan, Hayy ve Kayyum olan yüce Allah'tan bağışlanma diler ve O'na tövbe ederim.",
      "updated": "2025-05-08 18:30:18.159Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ وَأَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَرَسُولُكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَكَ مِنْهُ عَبْدُكَ وَرَسُولُكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَسْأَلُكَ مَا قَضَيْتَ لِي مِنْ أَمْرٍ أَنْ تَجْعَلَ عَاقِبَتَهُ رُشْدًا",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.162Z",
      "englishTranslation": "O Allah, I ask You for all that is good, in this world and the next, what I know and what I do not know. I seek refuge in You from all that is evil, in this world and the next, what I know and what I do not know. I ask You for Paradise and for that which brings one nearer to it, in word and deed. I seek refuge in You from Hell and from that which brings one nearer to it, in word and deed. I ask You for the good that Your servant and Messenger Muhammad (peace be upon him) asked of You, and I seek refuge in You from the evil from which Your servant and Messenger Muhammad (peace be upon him) sought refuge. I ask You to make the outcome of all my affairs good.",
      "germanTranslation": "O Allah, ich bitte Dich um alles Gute, in dieser Welt und im Jenseits, was ich weiß und was ich nicht weiß. Ich suche Zuflucht bei Dir vor allem Bösen, in dieser Welt und im Jenseits, was ich weiß und was ich nicht weiß. Ich bitte Dich um das Paradies und um das, was einem näher dazu bringt, in Wort und Tat. Ich suche Zuflucht bei Dir vor der Hölle und vor dem, was einem näher dazu bringt, in Wort und Tat. Ich bitte Dich um das Gute, das Dein Diener und Gesandter Muhammad (Friede sei mit ihm) von Dir erbeten hat, und ich suche Zuflucht bei Dir vor dem Übel, vor dem Dein Diener und Gesandter Muhammad (Friede sei mit ihm) Zuflucht suchte. Ich bitte Dich, das Ergebnis all meiner Angelegenheiten gut sein zu lassen.",
      "id": "87hiv86gfa3r505",
      "source": "Sunan Ibn Majah 3846",
      "transliteration": "Allahumma inni as'aluka minal-khayri kullihi 'ajilihi wa ajilihi ma 'alimtu minhu wa ma lam a'lam, wa a'udhu bika minash-sharri kullihi 'ajilihi wa ajilihi ma 'alimtu minhu wa ma lam a'lam, wa as'alukal-jannata wa ma qarraba ilayha min qawlin aw 'amalin, wa a'udhu bika minan-nari wa ma qarraba ilayha min qawlin aw 'amalin, wa as'aluka min khayri ma sa'alaka 'abduka wa rasuluka Muhammadun sallallahu 'alayhi wa sallam, wa a'udhu bika min sharri mast'a'adha minhu 'abduka wa rasuluka Muhammadun sallallahu 'alayhi wa sallam, wa as'aluka ma qadayta li min amrin an taj'ala 'aqibatahu rushda",
      "turkishTranslation": "Allah'ım! Bildiğim ve bilmediğim bütün hayırları, dünya ve ahirete ait olanları Senden istiyorum. Bildiğim ve bilmediğim bütün şerlerden, dünya ve ahirete ait olanlardan Sana sığınıyorum. Cenneti ve beni ona yaklaştıracak söz ve amelleri Senden istiyorum. Cehennemden ve beni ona yaklaştıracak söz ve amellerden Sana sığınıyorum. Kulun ve elçin Muhammed'in (sallallahu aleyhi ve sellem) Senden istediği hayırları istiyorum. Kulun ve elçin Muhammed'in (sallallahu aleyhi ve sellem) Sana sığındığı şerlerden Sana sığınıyorum. Hakkımda takdir ettiğin her işin sonucunu hayırlı kılmanı istiyorum.",
      "updated": "2025-05-08 18:30:18.162Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.166Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sadness, from weakness and laziness, from miserliness and cowardice, from being overcome by debt and overpowered by men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Traurigkeit, vor Schwäche und Faulheit, vor Geiz und Feigheit, davor, von Schulden überwältigt zu werden und von Männern beherrscht zu werden.",
      "id": "9ftk060340v9222",
      "source": "Sahih al-Bukhari 6369",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'id-dayn wa ghalabatir-rijal",
      "turkishTranslation": "Allah'ım! Kederden, üzüntüden, acizlikten, tembellikten, cimrilikten, korkaklıktan, borç yükünden ve insanların baskısından Sana sığınırım.",
      "updated": "2025-05-08 18:30:18.166Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.169Z",
      "englishTranslation": "Our Lord, give us in this world good and in the Hereafter good and protect us from the punishment of the Fire.",
      "germanTranslation": "Unser Herr, gib uns im Diesseits Gutes und im Jenseits Gutes und bewahre uns vor der Strafe des Feuers.",
      "id": "fp741snwwp4da9r",
      "source": "Qur'an 2:201",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar",
      "turkishTranslation": "Rabbimiz! Bize dünyada iyilik ver, ahirette de iyilik ver ve bizi cehennem azabından koru.",
      "updated": "2025-05-08 18:30:18.169Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Forgiveness",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:30:18.173Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "b658dd43o75v938",
      "source": "Sahih Muslim 2721",
      "transliteration": "Allahumma inni as'alukal-huda wat-tuqa wal-'afafa wal-ghina",
      "turkishTranslation": "Allah'ım! Senden hidayet, takva, iffet ve gönül zenginliği istiyorum.",
      "updated": "2025-05-08 18:30:18.173Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.257Z",
      "englishTranslation": "O Allah, I seek refuge in You from the evil of what I have done and the evil of what I have not done.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor dem Übel dessen, was ich getan habe, und dem Übel dessen, was ich nicht getan habe.",
      "id": "j24252711ucih3x",
      "source": "Muslim 2716",
      "transliteration": "Allahumma inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal.",
      "turkishTranslation": "Allah'ım, yaptıklarımın şerrinden ve yapmadıklarımın şerrinden sana sığınırım.",
      "updated": "2025-05-08 18:47:15.257Z"
    },
    {
      "arabicText": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.263Z",
      "englishTranslation": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
      "germanTranslation": "Ich suche Zuflucht in den vollkommenen Worten Allahs vor dem Bösen dessen, was Er erschaffen hat.",
      "id": "9705bh1q5y7js30",
      "source": "Tirmidhi 3604",
      "transliteration": "A'udhu bi kalimatillahi at-tammati min sharri ma khalaq.",
      "turkishTranslation": "Allah'ın mükemmel kelimelerine sığınırım, yarattıklarının şerrinden.",
      "updated": "2025-05-08 18:47:15.263Z"
    },
    {
      "arabicText": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.267Z",
      "englishTranslation": "In the name of Allah, with whose name nothing can harm on earth or in heaven, and He is the All-Hearing, All-Knowing.",
      "germanTranslation": "Im Namen Allahs, mit dessen Namen nichts auf der Erde oder im Himmel Schaden zufügen kann, und Er ist der Allhörende, der Allwissende.",
      "id": "6waon7k126i02w8",
      "source": "Abu Dawud 5088",
      "transliteration": "Bismillahi alladhi la yadurru ma'as-mihi shay'un fil-ardi wa la fis-sama'i wa huwas-Sami'ul-Alim.",
      "turkishTranslation": "Yerde ve gökte ismiyle hiçbir şeyin zarar veremeyeceği Allah'ın adıyla. O, işitendir, bilendir.",
      "updated": "2025-05-08 18:47:15.267Z"
    },
        {
      "arabicText": "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.271Z",
      "englishTranslation": "Allah is sufficient for me, there is no god but Him. In Him I place my trust, and He is the Lord of the Mighty Throne.",
      "germanTranslation": "Allah genügt mir, es gibt keinen Gott außer Ihm. Auf Ihn verlasse ich mich, und Er ist der Herr des gewaltigen Thrones.",
      "id": "2e5v9o6x7e4su16",
      "source": "Quran 9:129",
      "transliteration": "Hasbiyallahu la ilaha illa huwa, 'alayhi tawakkaltu, wa huwa Rabbul-'arshil-'azim.",
      "turkishTranslation": "Allah bana yeter, O'ndan başka ilah yoktur. Ben O'na güvendim ve O, büyük Arş'ın Rabbidir.",
      "updated": "2025-05-08 18:47:15.271Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.274Z",
      "englishTranslation": "O Allah, I ask You for forgiveness and well-being in this world and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Vergebung und Wohlergehen im Diesseits und im Jenseits.",
      "id": "0id0716hn97on0l",
      "source": "Ibn Majah 3871",
      "transliteration": "Allahumma inni as'alukal-'afwa wal-'afiyata fid-dunya wal-akhirah.",
      "turkishTranslation": "Allah'ım, senden dünya ve ahirette af ve afiyet diliyorum.",
      "updated": "2025-05-08 18:47:15.274Z"
    },
    {
      "arabicText": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.276Z",
      "englishTranslation": "I seek refuge in Allah from the accursed Satan.",
      "germanTranslation": "Ich suche Zuflucht bei Allah vor dem verfluchten Satan.",
      "id": "923t7z84dyz7953",
      "source": "Quran 16:98",
      "transliteration": "A'udhu billahi minash-shaytanir-rajim.",
      "turkishTranslation": "Kovulmuş şeytandan Allah'a sığınırım.",
      "updated": "2025-05-08 18:47:15.276Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.279Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sorrow, from weakness and laziness, from cowardice and miserliness, from being overwhelmed by debt and overpowered by men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Trauer, vor Schwäche und Faulheit, vor Feigheit und Geiz, vor Schuldenlast und der Unterdrückung durch Menschen.",
      "id": "bv79lkeh4rbftno",
      "source": "Bukhari 6369",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazan, wal-'ajzi wal-kasal, wal-jubni wal-bukhl, wa dal'id-dayni wa ghalabatir-rijal.",
      "turkishTranslation": "Allah'ım, senden üzüntü ve kederden, acizlik ve tembellikten, korkaklık ve cimrilikten, borç yükünden ve insanların baskısından sana sığınırım.",
      "updated": "2025-05-08 18:47:15.279Z"
    },
    {
      "arabicText": "اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.283Z",
      "englishTranslation": "O Allah, protect me from my front, behind me, from my right, from my left, from above me, and I seek refuge in Your greatness from being taken unaware from beneath me.",
      "germanTranslation": "O Allah, beschütze mich von vorne, von hinten, von rechts, von links, von oben, und ich suche Zuflucht in Deiner Größe davor, von unten überrascht zu werden.",
      "id": "6114670j9847n9e",
      "source": "Abu Dawud 5064",
      "transliteration": "Allahumma ihfazni min bayni yadayya, wa min khalfi, wa 'an yamini, wa 'an shimali, wa min fawqi, wa a'udhu bi 'azamatika an ughtala min tahti.",
      "turkishTranslation": "Allah'ım, önümden, arkamdan, sağımdan, solumdan ve üstümden gelecek kötülüklerden koru. Aşağıdan ansızın yakalanmaktan da senin azametine sığınırım.",
      "updated": "2025-05-08 18:47:15.283Z"
    },
    {
      "arabicText": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.288Z",
      "englishTranslation": "There is no god but Allah alone, with no partner. To Him belongs the dominion and to Him belongs all praise, and He is over all things competent.",
      "germanTranslation": "Es gibt keinen Gott außer Allah allein, ohne Partner. Ihm gehört die Herrschaft und Ihm gebührt alles Lob, und Er hat Macht über alle Dinge.",
      "id": "5zj2h8mwra48y4k",
      "source": "Tirmidhi 3431",
      "transliteration": "La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa huwa 'ala kulli shay'in qadir.",
      "turkishTranslation": "Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'na mahsustur ve O her şeye kadirdir.",
      "updated": "2025-05-08 18:47:15.288Z"
    },
    {
      "arabicText": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.290Z",
      "englishTranslation": "I am pleased with Allah as my Lord, Islam as my religion, and Muhammad (peace be upon him) as my Prophet.",
      "germanTranslation": "Ich bin zufrieden mit Allah als meinem Herrn, mit dem Islam als meiner Religion und mit Muhammad (Friede sei auf ihm) als meinem Propheten.",
      "id": "5pu3yuu4878o184",
      "source": "Abu Dawud 5072",
      "transliteration": "Raditu billahi Rabban, wa bil-Islami dinan, wa bi-Muhammadin (sallallahu 'alayhi wa sallam) nabiyya.",
      "turkishTranslation": "Allah'ı Rab, İslam'ı din, Muhammed'i (sallallahu aleyhi ve sellem) peygamber olarak kabul ettim.",
      "updated": "2025-05-08 18:47:15.290Z"
    },
    {
      "arabicText": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.293Z",
      "englishTranslation": "Glory be to Allah and praise Him, glory be to Allah the Almighty.",
      "germanTranslation": "Preis sei Allah und Lob sei Ihm, Preis sei Allah, dem Allmächtigen.",
      "id": "5h3n1602fo23b4z",
      "source": "Muslim 2691",
      "transliteration": "Subhanallahi wa bihamdihi, subhanallahil-'azim.",
      "turkishTranslation": "Allah'ı tesbih ve hamd ederim, yüce Allah'ı tesbih ederim.",
      "updated": "2025-05-08 18:47:15.293Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الْأَسْقَامِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.295Z",
      "englishTranslation": "O Allah, I seek refuge in You from leprosy, madness, elephantiasis, and evil diseases.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Lepra, Wahnsinn, Elefantiasis und bösen Krankheiten.",
      "id": "5cd9n0d9n1s9gq6",
      "source": "Abu Dawud 1554",
      "transliteration": "Allahumma inni a'udhu bika minal-barasi, wal-jununi, wal-judhami, wa min sayyi'il-asqam.",
      "turkishTranslation": "Allah'ım, cüzzamdan, delilikten, cüzamdan ve kötü hastalıklardan sana sığınırım.",
      "updated": "2025-05-08 18:47:15.295Z"
    },
    {
      "arabicText": "أَعُوذُ بِوَجْهِ اللَّهِ الْكَرِيمِ وَبِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا يُنْزَلُ مِنَ السَّمَاءِ وَشَرِّ مَا يَعْرُجُ فِيهَا",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.298Z",
      "englishTranslation": "I seek refuge in the Noble Face of Allah and His perfect words from the evil of what descends from the sky and the evil of what ascends into it.",
      "germanTranslation": "Ich suche Zuflucht im edlen Angesicht Allahs und in Seinen vollkommenen Worten vor dem Bösen dessen, was vom Himmel herabkommt und dem Bösen dessen, was in ihn hinaufsteigt.",
      "id": "2d52f1ttutv760e",
      "source": "Ibn Majah 3549",
      "transliteration": "A'udhu bi-wajhillahil-karimi wa bi-kalimatillahi at-tammati min sharri ma yunzalu minas-sama'i wa sharri ma ya'ruju fiha.",
      "turkishTranslation": "Gökten inenin ve göğe yükselenin şerrinden, Allah'ın Kerim yüzüne ve mükemmel kelimelerine sığınırım.",
      "updated": "2025-05-08 18:47:15.298Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.300Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the change of Your protection, the suddenness of Your punishment, and all Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir davor, dass Deine Gaben schwinden, Dein Schutz sich ändert, Deine Strafe plötzlich kommt und vor all Deinem Zorn.",
      "id": "o46gg24xqa31fsl",
      "source": "Muslim 2739",
      "transliteration": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik.",
      "turkishTranslation": "Allah'ım, nimetlerinin gitmesinden, afiyetinin değişmesinden, cezanın ansızın gelmesinden ve bütün gazabından sana sığınırım.",
      "updated": "2025-05-08 18:47:15.300Z"
    },
    {
      "arabicText": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.303Z",
      "englishTranslation": "Allah is sufficient for us, and He is the best Disposer of affairs.",
      "germanTranslation": "Allah genügt uns, und Er ist der beste Beschützer.",
      "id": "4829vgx41f214ml",
      "source": "Quran 3:173",
      "transliteration": "Hasbunallahu wa ni'mal-wakil.",
      "turkishTranslation": "Allah bize yeter, O ne güzel vekildir.",
      "updated": "2025-05-08 18:47:15.303Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ، وَمِنْ زَوْجٍ تُشَيِّبُنِي قَبْلَ الْمَشِيبِ، وَمِنْ وَلَدٍ يَكُونُ عَلَيَّ رَبًّا، وَمِنْ مَالٍ يَكُونُ عَلَيَّ عَذَابًا، وَمِنْ خَلِيلٍ مَاكِرٍ عَيْنُهُ تَرَانِي وَقَلْبُهُ يَرْعَانِي، إِنْ رَأَى حَسَنَةً دَفَنَهَا، وَإِذَا رَأَى سَيِّئَةً أَذَاعَهَا",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.308Z",
      "englishTranslation": "O Allah, I seek refuge in You from an evil neighbor, from a spouse who causes me to age before old age, from a child who becomes my master, from wealth that becomes a punishment for me, and from a cunning friend whose eyes watch me and whose heart schemes against me—if he sees a good deed, he hides it, and if he sees an evil deed, he spreads it.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor einem schlechten Nachbarn, einem Ehepartner, der mich vor der Zeit altern lässt, einem Kind, das über mich herrscht, Reichtum, der mir zur Strafe wird, und einem hinterlistigen Freund, dessen Auge mich sieht und dessen Herz mir nachstellt—wenn er eine gute Tat sieht, verbirgt er sie, und wenn er eine schlechte sieht, verbreitet er sie.",
      "id": "5fjebahv100sf3x",
      "source": "Tirmidhi 3487",
      "transliteration": "Allahumma inni a'udhu bika min jaris-su'i, wa min zawjin tushayyibuni qablal-mashibi, wa min waladin yakunu 'alayya rabban, wa min malin yakunu 'alayya 'adhaban, wa min khalilin makirin 'aynuhu tarani wa qalbuhu yar'ani, in ra'a hasanatan dafanaha, wa idha ra'a sayyi'atan adha'aha.",
      "turkishTranslation": "Allah'ım, kötü komşudan, beni yaşlandıran eşten, bana efendi olacak çocuktan, bana azap olacak maldan, gözü beni gören ve kalbi bana tuzak kuran hain dosttan sana sığınırım. İyilik görürse gizler, kötülük görürse yayar.",
      "updated": "2025-05-08 18:47:15.308Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ، وَالْقِلَّةِ، وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.311Z",
      "englishTranslation": "O Allah, I seek refuge in You from poverty, scarcity, and humiliation, and I seek refuge in You from oppressing or being oppressed.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Armut, Mangel und Erniedrigung, und ich suche Zuflucht bei Dir davor, zu unterdrücken oder unterdrückt zu werden.",
      "id": "dhv8q41cjtcd37r",
      "source": "Abu Dawud 1544",
      "transliteration": "Allahumma inni a'udhu bika minal-faqri, wal-qillati, wadh-dhillati, wa a'udhu bika min an azlima aw uzlam.",
      "turkishTranslation": "Allah'ım, fakirlikten, azlıktan ve zilletten sana sığınırım. Zulmetmekten veya zulme uğramaktan da sana sığınırım.",
      "updated": "2025-05-08 18:47:15.311Z"
    },
    {
      "arabicText": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.313Z",
      "englishTranslation": "There is no power nor strength except with Allah.",
      "germanTranslation": "Es gibt keine Macht und keine Kraft außer durch Allah.",
      "id": "dy57ozkbjq51qwu",
      "source": "Bukhari 6384",
      "transliteration": "La hawla wa la quwwata illa billah.",
      "turkishTranslation": "Güç ve kuvvet ancak Allah'ın yardımıyladır.",
      "updated": "2025-05-08 18:47:15.313Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.316Z",
      "englishTranslation": "O Allah, I seek refuge in You from disbelief and poverty.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Unglauben und Armut.",
      "id": "6789cb3gvrc8l9b",
      "source": "Nasai 5467",
      "transliteration": "Allahumma inni a'udhu bika minal-kufri wal-faqri.",
      "turkishTranslation": "Allah'ım, küfürden ve fakirlikten sana sığınırım.",
      "updated": "2025-05-08 18:47:15.316Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Protection",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 18:47:15.318Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "218x0z8k9jb57d2",
      "source": "Muslim 2721",
      "transliteration": "Allahumma inni as'alukal-huda wat-tuqa wal-'afafa wal-ghina.",
      "turkishTranslation": "Allah'ım, senden hidayet, takva, iffet ve zenginlik diliyorum.",
      "updated": "2025-05-08 18:47:15.318Z"
    },
    {
      "arabicText": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.557Z",
      "englishTranslation": "O Allah, grant me health in my body. O Allah, grant me health in my hearing. O Allah, grant me health in my sight. There is no god but You.",
      "germanTranslation": "O Allah, gewähre mir Gesundheit in meinem Körper. O Allah, gewähre mir Gesundheit in meinem Gehör. O Allah, gewähre mir Gesundheit in meinem Sehen. Es gibt keinen Gott außer Dir.",
      "id": "113aw650099812z",
      "source": "Sunan Abi Dawud 5090",
      "transliteration": "Allahumma 'afini fi badani, Allahumma 'afini fi sam'i, Allahumma 'afini fi basari, la ilaha illa anta.",
      "turkishTranslation": "Allah'ım, bedenime sağlık ver. Allah'ım, kulağıma sağlık ver. Allah'ım, gözüme sağlık ver. Senden başka ilah yoktur.",
      "updated": "2025-05-08 19:01:06.557Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ البَرَصِ، وَالجُنُونِ، وَالجُذَامِ، وَمِنْ سَيِّئِ الأَسْقَامِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.567Z",
      "englishTranslation": "O Allah, I seek refuge in You from leprosy, madness, elephantiasis, and evil diseases.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Lepra, Wahnsinn, Elefantiasis und bösen Krankheiten.",
      "id": "vrhw3596i5ol807",
      "source": "Sunan Abi Dawud 1554",
      "transliteration": "Allahumma inni a'udhu bika minal-barasi, wal-jununi, wal-judhami, wa min sayyi'il-asqam.",
      "turkishTranslation": "Allah'ım, cüzzamdan, delilikten, fil hastalığından ve kötü hastalıklardan sana sığınırım.",
      "updated": "2025-05-08 19:01:06.567Z"
    },
    {
      "arabicText": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.572Z",
      "englishTranslation": "In the name of Allah, with Whose name nothing on earth or in the sky can cause harm, and He is the All-Hearing, All-Knowing.",
      "germanTranslation": "Im Namen Allahs, mit Dessen Namen nichts auf der Erde oder im Himmel Schaden zufügen kann, und Er ist der Allhörende, der Allwissende.",
      "id": "93442814tq89nit",
      "source": "Sunan Abi Dawud 5088",
      "transliteration": "Bismillah alladhi la yadurru ma'asmihi shay'un fil-ardi wa la fis-sama'i wa huwas-Sami'ul-Alim.",
      "turkishTranslation": "Allah'ın adıyla ki, O'nun adı anıldığında yerde ve gökte hiçbir şey zarar veremez. O, işitendir, bilendir.",
      "updated": "2025-05-08 19:01:06.572Z"
    },
    {
      "arabicText": "أَسْأَلُ اللَّهَ العَظِيمَ رَبَّ العَرْشِ العَظِيمِ أَنْ يَشْفِيَكَ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.576Z",
      "englishTranslation": "I ask Almighty Allah, Lord of the Magnificent Throne, to cure you.",
      "germanTranslation": "Ich bitte den erhabenen Allah, den Herrn des gewaltigen Thrones, dich zu heilen.",
      "id": "5w7hi30s46id130",
      "source": "Sunan Abi Dawud 3106",
      "transliteration": "As'alullah al-'Azima Rabbal-'Arshil-'Azim an yashfiyak.",
      "turkishTranslation": "Yüce Arş'ın Rabbi olan Allah'tan sana şifa vermesini diliyorum.",
      "updated": "2025-05-08 19:01:06.576Z"
    },
    {
      "arabicText": "اللَّهُمَّ اشْفِهِ، اللَّهُمَّ اشْفِهِ، اللَّهُمَّ اشْفِهِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.580Z",
      "englishTranslation": "O Allah, cure him. O Allah, cure him. O Allah, cure him.",
      "germanTranslation": "O Allah, heile ihn. O Allah, heile ihn. O Allah, heile ihn.",
      "id": "5t5o5d165ovymx0",
      "source": "Sahih Muslim 2191",
      "transliteration": "Allahumma ashfih, Allahumma ashfih, Allahumma ashfih.",
      "turkishTranslation": "Allah'ım, ona şifa ver. Allah'ım, ona şifa ver. Allah'ım, ona şifa ver.",
      "updated": "2025-05-08 19:01:06.580Z"
    },
    {
      "arabicText": "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.583Z",
      "englishTranslation": "Allah is sufficient for me. There is no god but Him. In Him I place my trust, and He is the Lord of the Great Throne.",
      "germanTranslation": "Allah genügt mir. Es gibt keinen Gott außer Ihm. Auf Ihn verlasse ich mich, und Er ist der Herr des gewaltigen Thrones.",
      "id": "32q4dgsgq3b01bp",
      "source": "Quran 9:129",
      "transliteration": "Hasbiyallahu la ilaha illa huwa, 'alayhi tawakkaltu wa huwa Rabbul-'Arshil-'Azim.",
      "turkishTranslation": "Allah bana yeter. O'ndan başka ilah yoktur. Ben O'na güvendim ve O, büyük Arş'ın Rabbidir.",
      "updated": "2025-05-08 19:01:06.583Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالهَرَمِ، وَالبُخْلِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المَحْيَا وَالمَمَاتِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.588Z",
      "englishTranslation": "O Allah, I seek refuge in You from helplessness, laziness, cowardice, old age, and miserliness. I seek refuge in You from the torment of the grave and the trials of life and death.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Hilflosigkeit, Faulheit, Feigheit, Altersschwäche und Geiz. Ich suche Zuflucht bei Dir vor der Qual des Grabes und den Prüfungen des Lebens und des Todes.",
      "id": "roju8169h7gp097",
      "source": "Sahih Bukhari 6367",
      "transliteration": "Allahumma inni a'udhu bika minal-'ajzi wal-kasali, wal-jubni wal-harami, wal-bukhli, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min fitnatil-mahya wal-mamat.",
      "turkishTranslation": "Allah'ım, acizlikten, tembellikten, korkaklıktan, yaşlılıktan ve cimrilikten sana sığınırım. Kabir azabından, hayat ve ölüm fitnesinden sana sığınırım.",
      "updated": "2025-05-08 19:01:06.587Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.592Z",
      "englishTranslation": "O Allah, I ask You for pardon and well-being in this life and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Vergebung und Wohlergehen im Diesseits und im Jenseits.",
      "id": "l8ui07yd52n2xlb",
      "source": "Sunan Ibn Majah 3871",
      "transliteration": "Allahumma inni as'alukal-'afwa wal-'afiyah fid-dunya wal-akhirah.",
      "turkishTranslation": "Allah'ım, senden dünya ve ahirette afiyet ve bağışlanma diliyorum.",
      "updated": "2025-05-08 19:01:06.592Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.596Z",
      "englishTranslation": "Our Lord, grant us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.",
      "germanTranslation": "Unser Herr, gib uns im Diesseits Gutes und im Jenseits Gutes und bewahre uns vor der Strafe des Feuers.",
      "id": "ac1umn4ylx09ez1",
      "source": "Quran 2:201",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar.",
      "turkishTranslation": "Rabbimiz, bize dünyada iyilik ver, ahirette de iyilik ver ve bizi cehennem azabından koru.",
      "updated": "2025-05-08 19:01:06.596Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.604Z",
      "englishTranslation": "O Allah, I ask You for well-being in this life and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Wohlergehen im Diesseits und im Jenseits.",
      "id": "j33w2089xkq7l88",
      "source": "Musnad Ahmad 26793",
      "transliteration": "Allahumma inni as'alukal-'afiyah fid-dunya wal-akhirah.",
      "turkishTranslation": "Allah'ım, senden dünya ve ahirette afiyet diliyorum.",
      "updated": "2025-05-08 19:01:06.604Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَدَمِ، وَأَعُوذُ بِكَ مِنَ التَّرَدِّي، وَأَعُوذُ بِكَ مِنَ الغَرَقِ، وَالحَرَقِ، وَالهَرَمِ، وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ المَوْتِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.609Z",
      "englishTranslation": "O Allah, I seek refuge in You from being crushed, falling, drowning, burning, and old age. I seek refuge in You from being misled by Satan at the time of death.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Zerstörung, Stürzen, Ertrinken, Verbrennen und Altersschwäche. Ich suche Zuflucht bei Dir davor, dass Satan mich beim Tod in die Irre führt.",
      "id": "ecd5ka013b6h0v5",
      "source": "Sunan Abi Dawud 1552",
      "transliteration": "Allahumma inni a'udhu bika minal-hadami, wa a'udhu bika minat-taraddi, wa a'udhu bika minal-gharaqi, wal-haraqi, wal-harami, wa a'udhu bika an yatakhabbatani ash-shaytanu 'indal-mawt.",
      "turkishTranslation": "Allah'ım, ezilmekten, düşmekten, boğulmaktan, yanmaktan ve yaşlılıktan sana sığınırım. Ölüm anında şeytanın beni saptırmasından sana sığınırım.",
      "updated": "2025-05-08 19:01:06.609Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ، وَأَعُوذُ بِكَ مِنَ الخِيَانَةِ فَإِنَّهَا بِئْسَتِ البِطَانَةُ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.612Z",
      "englishTranslation": "O Allah, I seek refuge in You from hunger, for it is a bad companion, and I seek refuge in You from betrayal, for it is a bad inner trait.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Hunger, denn er ist ein schlechter Gefährte, und ich suche Zuflucht bei Dir vor Verrat, denn er ist eine schlechte Eigenschaft.",
      "id": "to520ig7onh3733",
      "source": "Sunan Abi Dawud 1547",
      "transliteration": "Allahumma inni a'udhu bika minal-ju'i fa innahu bi'sad-daji'u, wa a'udhu bika minal-khiyanati fa innaha bi'satul-bitana.",
      "turkishTranslation": "Allah'ım, açlıktan sana sığınırım, çünkü o ne kötü bir arkadaştır. Hainlikten de sana sığınırım, çünkü o ne kötü bir huydur.",
      "updated": "2025-05-08 19:01:06.612Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العِلَلِ وَالأَسْقَامِ وَالأَوْجَاعِ وَالأَحْزَانِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.616Z",
      "englishTranslation": "O Allah, I seek refuge in You from ailments, diseases, pains, and sorrows.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Gebrechen, Krankheiten, Schmerzen und Kummer.",
      "id": "2mp788atikma73e",
      "source": "Musnad Ahmad 15536",
      "transliteration": "Allahumma inni a'udhu bika minal-'ilali wal-asqami wal-awja'i wal-ahzani.",
      "turkishTranslation": "Allah'ım, hastalıklardan, dertlerden, ağrılardan ve üzüntülerden sana sığınırım.",
      "updated": "2025-05-08 19:01:06.616Z"
    },
     {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الفَقْرِ، وَالقِلَّةِ، وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.618Z",
      "englishTranslation": "O Allah, I seek refuge in You from poverty, scarcity, and humiliation. I seek refuge in You from oppressing or being oppressed.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Armut, Mangel und Erniedrigung. Ich suche Zuflucht bei Dir davor, zu unterdrücken oder unterdrückt zu werden.",
      "id": "dh16ygbhay894ln",
      "source": "Sunan Ibn Majah 3834",
      "transliteration": "Allahumma inni a'udhu bika minal-faqri, wal-qillati, wadh-dhillati, wa a'udhu bika min an azlima aw uzlam.",
      "turkishTranslation": "Allah'ım, fakirlikten, azlıktan ve zilletten sana sığınırım. Zulmetmekten veya zulme uğramaktan sana sığınırım.",
      "updated": "2025-05-08 19:01:06.618Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.620Z",
      "englishTranslation": "O Allah, rectify my religion, which is the safeguard of my affairs. Rectify my worldly life, where I earn my living. Rectify my Hereafter, where I will return. Make life a means for me to increase in every good, and make death a relief for me from every evil.",
      "germanTranslation": "O Allah, korrigiere meine Religion, die der Schutz meiner Angelegenheiten ist. Korrigiere mein diesseitiges Leben, in dem ich meinen Lebensunterhalt verdiene. Korrigiere mein Jenseits, wohin ich zurückkehren werde. Mache das Leben für mich zu einem Mittel, in allem Guten zuzunehmen, und mache den Tod für mich zu einer Erleichterung von allem Übel.",
      "id": "z6p3fh5cg9581xs",
      "source": "Sahih Muslim 2720",
      "transliteration": "Allahumma aslih li diniyalladhi huwa 'ismatu amri, wa aslih li dunyaya allati fiha ma'ashi, wa aslih li akhirati allati fiha ma'adi, waj'alil-hayata ziyadatan li fi kulli khayrin, waj'alil-mawta rahatan li min kulli sharrin.",
      "turkishTranslation": "Allah'ım, işlerimin koruyucusu olan dinimi düzelt. Geçimimi sağladığım dünyamı düzelt. Dönüş yerim olan ahiretimi düzelt. Hayatı her iyilikte artış vesilesi kıl, ölümü de her kötülükten kurtuluş vesilesi kıl.",
      "updated": "2025-05-08 19:01:06.620Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.624Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the loss of Your protection, the suddenness of Your punishment, and all forms of Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor dem Entzug Deiner Gaben, dem Verlust Deines Schutzes, dem plötzlichen Eintreten Deiner Strafe und allem, was Deinen Zorn erregt.",
      "id": "l24v4wzghfcp212",
      "source": "Sahih Muslim 2739",
      "transliteration": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik.",
      "turkishTranslation": "Allah'ım, nimetlerinin yok olmasından, afiyetinin değişmesinden, cezanın aniden gelmesinden ve bütün gazabından sana sığınırım.",
      "updated": "2025-05-08 19:01:06.624Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.626Z",
      "englishTranslation": "O Allah, I ask You for the good that Your Prophet Muhammad (peace be upon him) asked You for, and I seek refuge in You from the evil from which Your Prophet Muhammad (peace be upon him) sought refuge.",
      "germanTranslation": "O Allah, ich bitte Dich um das Gute, das Dein Prophet Muhammad (Friede sei mit ihm) von Dir erbeten hat, und ich suche Zuflucht bei Dir vor dem Übel, vor dem Dein Prophet Muhammad (Friede sei mit ihm) Zuflucht gesucht hat.",
      "id": "erza0a7w08c9u6p",
      "source": "Jami' at-Tirmidhi 3523",
      "transliteration": "Allahumma inni as'aluka min khayri ma sa'alaka minhu nabiyyuka Muhammadun sallallahu 'alayhi wa sallam, wa a'udhu bika min sharri mast'a'adh minhu nabiyyuka Muhammadun sallallahu 'alayhi wa sallam.",
      "turkishTranslation": "Allah'ım, Peygamberin Muhammed'in (sallallahu aleyhi ve sellem) senden istediği hayrı ben de senden istiyorum. Peygamberin Muhammed'in (sallallahu aleyhi ve sellem) sığındığı şerlerden ben de sana sığınıyorum.",
      "updated": "2025-05-08 19:01:06.626Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.629Z",
      "englishTranslation": "O Allah, I seek refuge in You from helplessness, laziness, cowardice, miserliness, overwhelming debt, and the domination of men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Hilflosigkeit, Faulheit, Feigheit, Geiz, erdrückenden Schulden und der Unterdrückung durch Menschen.",
      "id": "ww62e565v05m987",
      "source": "Sahih Bukhari 6366",
      "transliteration": "Allahumma inni a'udhu bika minal-'ajzi wal-kasali, wal-jubni wal-bukhli, wa dala'id-dayni, wa ghalabatir-rijal.",
      "turkishTranslation": "Allah'ım, acizlikten, tembellikten, korkaklıktan, cimrilikten, borç yükünden ve insanların tahakkümünden sana sığınırım.",
      "updated": "2025-05-08 19:01:06.629Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَالحَزَنِ، وَالعَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.631Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sadness, from helplessness and laziness, from cowardice and miserliness, from overwhelming debt, and from the domination of men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Traurigkeit, vor Hilflosigkeit und Faulheit, vor Feigheit und Geiz, vor erdrückenden Schulden und der Unterdrückung durch Menschen.",
      "id": "mn0uyz7skzm9j3k",
      "source": "Sahih Bukhari 6366",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazan, wal-'ajzi wal-kasali, wal-jubni wal-bukhli, wa dala'id-dayni, wa ghalabatir-rijal.",
      "turkishTranslation": "Allah'ım, üzüntü ve kederden, acizlik ve tembellikten, korkaklık ve cimrilikten, borç yükünden ve insanların tahakkümünden sana sığınırım.",
      "updated": "2025-05-08 19:01:06.631Z"
    },
    {
      "arabicText": "اللَّهُمَّ اشْفِ مَرْضَانَا وَمَرْضَى المُسْلِمِينَ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.634Z",
      "englishTranslation": "O Allah, cure our sick and the sick among the Muslims.",
      "germanTranslation": "O Allah, heile unsere Kranken und die Kranken unter den Muslimen.",
      "id": "0e3q21n5bfl8qr1",
      "source": "Sahih Bukhari 5659",
      "transliteration": "Allahumma ashfi maradana wa maradal-muslimin.",
      "turkishTranslation": "Allah'ım, hastalarımıza ve Müslümanların hastalarına şifa ver.",
      "updated": "2025-05-08 19:01:06.634Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ وَالعَافِيَةَ، وَحُسْنَ الخُلُقِ، وَالرِّضَا بِالقَضَاءِ",
      "category": "Health",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:01:06.636Z",
      "englishTranslation": "O Allah, I ask You for health, well-being, good character, and contentment with divine decree.",
      "germanTranslation": "O Allah, ich bitte Dich um Gesundheit, Wohlergehen, guten Charakter und Zufriedenheit mit dem göttlichen Beschluss.",
      "id": "djt90ym29kw8p9k",
      "source": "Musnad Ahmad 24372",
      "transliteration": "Allahumma inni as'alukas-sihhata wal-'afiyah, wa husnal-khuluqi, war-rida bil-qada'i.",
      "turkishTranslation": "Allah'ım, senden sağlık, afiyet, güzel ahlak ve kaderine rıza diliyorum.",
      "updated": "2025-05-08 19:01:06.636Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.844Z",
      "englishTranslation": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.",
      "germanTranslation": "Unser Herr, gewähre uns von Dir Barmherzigkeit und bereite uns in unserer Angelegenheit rechtes Leiten.",
      "id": "jxv506tg3762utv",
      "source": "Surah Al-Kahf 18:10",
      "transliteration": "Rabbana atina min ladunka rahmatan wa hayyi' lana min amrina rashada",
      "turkishTranslation": "Rabbimiz, bize katından bir rahmet ver ve bize işimizde bir doğruluk hazırla.",
      "updated": "2025-05-08 19:02:38.844Z"
    },
    {
      "arabicText": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.852Z",
      "englishTranslation": "My Lord, expand for me my breast and ease for me my task.",
      "germanTranslation": "Mein Herr, weite mir meine Brust und erleichtere mir meine Aufgabe.",
      "id": "a14t1snrd547np0",
      "source": "Surah Taha 20:25-26",
      "transliteration": "Rabbi ishrah li sadri wa yassir li amri",
      "turkishTranslation": "Rabbim, göğsümü genişlet, işimi kolaylaştır.",
      "updated": "2025-05-08 19:02:38.852Z"
    },
    {
      "arabicText": "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.856Z",
      "englishTranslation": "O Allah, guide me and make me steadfast.",
      "germanTranslation": "O Allah, führe mich recht und mache mich standhaft.",
      "id": "fc4r3505cn2nn25",
      "source": "Sahih Muslim 2725",
      "transliteration": "Allahumma ihdini wa saddidni",
      "turkishTranslation": "Allah'ım, bana hidayet ver ve beni dosdoğru yola ilet.",
      "updated": "2025-05-08 19:02:38.856Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.859Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "w5187h4pe1uyx0z",
      "source": "Sahih Muslim 2721",
      "transliteration": "Allahumma inni as'aluka al-huda wa at-tuqa wa al-afafa wa al-ghina",
      "turkishTranslation": "Allah'ım, senden hidayet, takva, iffet ve zenginlik diliyorum.",
      "updated": "2025-05-08 19:02:38.859Z"
    },
    {
      "arabicText": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.863Z",
      "englishTranslation": "O Turner of the hearts, make my heart firm upon Your religion.",
      "germanTranslation": "O Wendender der Herzen, festige mein Herz auf Deiner Religion.",
      "id": "804r21kr49n6jtp",
      "source": "Sunan At-Tirmidhi 2140",
      "transliteration": "Ya muqalliba al-qulub thabbit qalbi ala deenik",
      "turkishTranslation": "Ey kalpleri evirip çeviren Allah'ım, kalbimi dinin üzere sabit kıl.",
      "updated": "2025-05-08 19:02:38.863Z"
    },
    {
      "arabicText": "رَبِّ زِدْنِي عِلْمًا",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.866Z",
      "englishTranslation": "My Lord, increase me in knowledge.",
      "germanTranslation": "Mein Herr, vermehre mein Wissen.",
      "id": "2200bh5u9unsrr7",
      "source": "Surah Taha 20:114",
      "transliteration": "Rabbi zidni ilma",
      "turkishTranslation": "Rabbim, benim ilmimi artır.",
      "updated": "2025-05-08 19:02:38.866Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَرِنَا الْحَقَّ حَقًّا وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا الْبَاطِلَ بَاطِلًا وَارْزُقْنَا اجْتِنَابَهُ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.869Z",
      "englishTranslation": "O Allah, show us the truth as truth and grant us the ability to follow it, and show us falsehood as falsehood and grant us the ability to avoid it.",
      "germanTranslation": "O Allah, zeige uns die Wahrheit als Wahrheit und gewähre uns, ihr zu folgen, und zeige uns das Falsche als falsch und gewähre uns, es zu meiden.",
      "id": "0955ph700y7tt87",
      "source": "Musnad Ahmad 1/435",
      "transliteration": "Allahumma arina al-haqqa haqqan warzuqna ittiba'ahu, wa arina al-batila batilan warzuqna ijtinabahu",
      "turkishTranslation": "Allah'ım, bize hakkı hak olarak göster ve ona uymayı nasip et, batılı da batıl olarak göster ve ondan uzak durmayı nasip et.",
      "updated": "2025-05-08 19:02:38.869Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.873Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the change in Your protection, the suddenness of Your punishment, and all forms of Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor dem Entzug Deiner Gaben, der Veränderung Deiner Gesundheit, dem plötzlichen Eintreffen Deiner Strafe und allem, was Deinen Zorn erregt.",
      "id": "67u2r0hj70x1920",
      "source": "Sahih Muslim 2739",
      "transliteration": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik",
      "turkishTranslation": "Allah'ım, nimetlerinin yok olmasından, afiyetinin değişmesinden, cezanın ansızın gelmesinden ve bütün gazabından sana sığınırım.",
      "updated": "2025-05-08 19:02:38.873Z"
    },
    {
      "arabicText": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.876Z",
      "englishTranslation": "Our Lord, do not let our hearts deviate after You have guided us. Grant us Your mercy. Indeed, You are the Bestower.",
      "germanTranslation": "Unser Herr, lass unsere Herzen nicht abschweifen, nachdem Du uns rechtgeleitet hast. Gewähre uns Deine Barmherzigkeit. Wahrlich, Du bist der Gabenverleiher.",
      "id": "2109o56l5v49j9f",
      "source": "Surah Al-Imran 3:8",
      "transliteration": "Rabbana la tuzigh qulubana ba'da idh hadaytana wa hab lana min ladunka rahmah, innaka antal-Wahhab",
      "turkishTranslation": "Rabbimiz, bize hidayet verdikten sonra kalplerimizi saptırma. Katından bize rahmet bağışla. Şüphesiz Sen, bol bol verensin.",
      "updated": "2025-05-08 19:02:38.876Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.880Z",
      "englishTranslation": "O Allah, I ask You for beneficial knowledge, lawful provision, and accepted deeds.",
      "germanTranslation": "O Allah, ich bitte Dich um nützliches Wissen, guten Lebensunterhalt und angenommene Taten.",
      "id": "jw220q95tboc50a",
      "source": "Sunan Ibn Majah 925",
      "transliteration": "Allahumma inni as'aluka ilman nafi'an, wa rizqan tayyiban, wa amalan mutaqabbalan",
      "turkishTranslation": "Allah'ım, senden faydalı ilim, helal rızık ve kabul edilen amel istiyorum.",
      "updated": "2025-05-08 19:02:38.880Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْنِي مِنَ الَّذِينَ إِذَا أَحْسَنُوا اسْتَبْشَرُوا، وَإِذَا أَسَاءُوا اسْتَغْفَرُوا",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.883Z",
      "englishTranslation": "O Allah, make me among those who, when they do good, rejoice, and when they do wrong, seek forgiveness.",
      "germanTranslation": "O Allah, mache mich zu denen, die, wenn sie Gutes tun, sich freuen, und wenn sie Fehler machen, um Vergebung bitten.",
      "id": "5lmz510006xz62w",
      "source": "Musnad Ahmad 5/170",
      "transliteration": "Allahummaj'alni min alladhina idha ahsanu istabsharu, wa idha asa'u istaghfaru",
      "turkishTranslation": "Allah'ım, beni iyilik yaptıklarında sevinen, kötülük yaptıklarında istiğfar edenlerden eyle.",
      "updated": "2025-05-08 19:02:38.883Z"
    },
    {
      "arabicText": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.890Z",
      "englishTranslation": "My Lord, make me and my descendants establishers of prayer. Our Lord, accept my supplication.",
      "germanTranslation": "Mein Herr, mache mich und meine Nachkommen zu denen, die das Gebet verrichten. Unser Herr, nimm mein Bittgebet an.",
      "id": "gg1vv3n9h2avzyo",
      "source": "Surah Ibrahim 14:40",
      "transliteration": "Rabbi ij'alni muqeema as-salati wa min dhurriyyati, Rabbana wa taqabbal du'a",
      "turkishTranslation": "Rabbim, beni ve soyumdan gelenleri namazı dosdoğru kılanlardan eyle. Rabbimiz, duamı kabul et.",
      "updated": "2025-05-08 19:02:38.890Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِيَ الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِن كُلِّ شَرٍّ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.892Z",
      "englishTranslation": "O Allah, rectify for me my religion, which is the safeguard of my affairs. Rectify for me my worldly life, in which is my livelihood. Rectify for me my Hereafter, in which is my return. Make life an increase for me in every good, and make death a relief for me from every evil.",
      "germanTranslation": "O Allah, korrigiere für mich meine Religion, die der Schutz meiner Angelegenheiten ist. Korrigiere für mich mein diesseitiges Leben, in dem mein Lebensunterhalt liegt. Korrigiere für mich mein Jenseits, in das ich zurückkehre. Mache das Leben für mich zu einer Zunahme an allem Guten und mache den Tod für mich zu einer Erleichterung von allem Übel.",
      "id": "322y806n9t4a3e7",
      "source": "Sahih Muslim 2720",
      "transliteration": "Allahumma aslih li diniya alladhi huwa ismatu amri, wa aslih li dunyaya allati fiha ma'ashi, wa aslih li akhiratiya allati fiha ma'adi, waj'al al-hayata ziyadatan li fi kulli khayr, waj'al al-mawta rahatan li min kulli sharr",
      "turkishTranslation": "Allah'ım, işlerimin koruyucusu olan dinimi benim için ıslah et. Geçim kaynağım olan dünyamı benim için ıslah et. Dönüş yerim olan ahiretimi benim için ıslah et. Hayatı her hayırda artış, ölümü de her şerden kurtuluş eyle.",
      "updated": "2025-05-08 19:02:38.892Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.896Z",
      "englishTranslation": "O Allah, I ask You for the ability to do good deeds, abandon evil deeds, love the poor, and that You forgive me and have mercy on me.",
      "germanTranslation": "O Allah, ich bitte Dich um die Fähigkeit, gute Taten zu vollbringen, schlechte Taten zu unterlassen, die Armen zu lieben, und dass Du mir vergibst und Dich meiner erbarmst.",
      "id": "t6gt01fc65atj82",
      "source": "Sunan At-Tirmidhi 3233",
      "transliteration": "Allahumma inni as'aluka fi'lal khayrat, wa tarkal munkarat, wa hubbal masakin, wa an taghfira li wa tarhamani",
      "turkishTranslation": "Allah'ım, senden hayırlı işler yapmayı, kötülükleri terk etmeyi, fakirleri sevmeyi, beni bağışlamanı ve bana merhamet etmeni istiyorum.",
      "updated": "2025-05-08 19:02:38.896Z"
    },
    {
      "arabicText": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.900Z",
      "englishTranslation": "My Lord, grant me wisdom and join me with the righteous.",
      "germanTranslation": "Mein Herr, gewähre mir Weisheit und füge mich den Rechtschaffenen bei.",
      "id": "43t916asl6mbjt9",
      "source": "Surah Ash-Shu'ara 26:83",
      "transliteration": "Rabbi hab li hukman wa alhiqni bis-salihin",
      "turkishTranslation": "Rabbim, bana hikmet ver ve beni salihlerle beraber eyle.",
      "updated": "2025-05-08 19:02:38.900Z"
    },
    {
      "arabicText": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.905Z",
      "englishTranslation": "O Allah, guide me among those You have guided, pardon me among those You have pardoned, turn to me in friendship among those You have turned in friendship, bless me in what You have given me, and protect me from the evil of what You have decreed.",
      "germanTranslation": "O Allah, leite mich unter denen, die Du rechtgeleitet hast, vergib mir unter denen, denen Du vergeben hast, wende Dich mir freundlich zu unter denen, denen Du Dich freundlich zugewandt hast, segne mich in dem, was Du mir gegeben hast, und beschütze mich vor dem Übel dessen, was Du bestimmt hast.",
      "id": "o3713ss20323ktp",
      "source": "Sunan Abu Dawud 1425",
      "transliteration": "Allahumma ihdini fi man hadayta, wa 'afini fi man 'afayta, wa tawallani fi man tawallayta, wa barik li fi ma a'tayta, wa qini sharra ma qadayta",
      "turkishTranslation": "Allah'ım, hidayet verdiklerinle bana hidayet ver, afiyet verdiklerinle bana afiyet ver, dost olduklarınla bana dost ol, verdiğin şeylerde bana bereket ver ve takdir ettiğin şerlerden beni koru.",
      "updated": "2025-05-08 19:02:38.905Z"
    },
    {
      "arabicText": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.908Z",
      "englishTranslation": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.",
      "germanTranslation": "Unser Herr, gewähre uns von unseren Gattinnen und Nachkommen Augentrost und mache uns zu einem Vorbild für die Gottesfürchtigen.",
      "id": "fv79x896h69e8r6",
      "source": "Surah Al-Furqan 25:74",
      "transliteration": "Rabbana hab lana min azwajina wa dhurriyatina qurrata a'yunin waj'alna lil-muttaqina imama",
      "turkishTranslation": "Rabbimiz, eşlerimizden ve çocuklarımızdan bize göz aydınlığı ver ve bizi takva sahiplerine önder eyle.",
      "updated": "2025-05-08 19:02:38.908Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.910Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sadness, from weakness and laziness, from miserliness and cowardice, from being overcome by debt and overpowered by men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Trauer, Schwäche und Faulheit, Geiz und Feigheit, Schuldenlast und der Unterdrückung durch Menschen.",
      "id": "x5mr4yxtcdumg9i",
      "source": "Sahih Bukhari 6369",
      "transliteration": "Allahumma inni a'udhu bika min al-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'id-dayn wa ghalabatir-rijal",
      "turkishTranslation": "Allah'ım, kederden, üzüntüden, acizlikten, tembellikten, cimrilikten, korkaklıktan, borç yükünden ve insanların baskısından sana sığınırım.",
      "updated": "2025-05-08 19:02:38.910Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.912Z",
      "englishTranslation": "O Allah, I ask You for steadfastness in affairs and determination in guidance.",
      "germanTranslation": "O Allah, ich bitte Dich um Standhaftigkeit in den Angelegenheiten und Entschlossenheit auf dem rechten Weg.",
      "id": "g70jz84k88z412u",
      "source": "Musnad Ahmad 3/152",
      "transliteration": "Allahumma inni as'aluka ath-thabata fil-amr, wal-azimata ala rushd",
      "turkishTranslation": "Allah'ım, senden işlerde sebat ve doğru yolda azim istiyorum.",
      "updated": "2025-05-08 19:02:38.912Z"
    },
    {
      "arabicText": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا",
      "category": "Guidance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:02:38.914Z",
      "englishTranslation": "My Lord, cause me to enter a truthful entrance and cause me to exit a truthful exit, and grant me from Yourself a supporting authority.",
      "germanTranslation": "Mein Herr, lasse mich in Wahrheit eintreten und in Wahrheit austreten, und gewähre mir von Dir eine unterstützende Macht.",
      "id": "4769h5349d34h3l",
      "source": "Surah Al-Isra 17:80",
      "transliteration": "Rabbi adkhilni mudkhala sidqin wa akhrijni mukhraja sidqin waj'al li min ladunka sultanan nasira",
      "turkishTranslation": "Rabbim, beni doğru bir girişle girdir ve doğru bir çıkışla çıkar. Katından bana yardımcı bir kuvvet ver.",
      "updated": "2025-05-08 19:02:38.914Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.353Z",
      "englishTranslation": "O Allah, help me remember You, express gratitude to You, and worship You in the best manner.",
      "germanTranslation": "O Allah, hilf mir, Dich zu gedenken, Dir Dank zu sagen und Dir auf beste Weise zu dienen.",
      "id": "y135t6a8yy0xn87",
      "source": "Sunan Abi Dawud 1522",
      "transliteration": "Allahumma a’inni ‘ala dhikrika, wa shukrika, wa husni ‘ibadatika",
      "turkishTranslation": "Allah'ım, seni anmamda, sana şükretmemde ve sana en güzel şekilde ibadet etmemde bana yardım et.",
      "updated": "2025-05-08 19:11:18.353Z"
    },
    {
      "arabicText": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.361Z",
      "englishTranslation": "All praise is due to Allah, by whose favor good deeds are completed.",
      "germanTranslation": "Alles Lob gebührt Allah, durch dessen Gunst die guten Taten vollendet werden.",
      "id": "6126uqxxvkklb57",
      "source": "Sahih Muslim 71",
      "transliteration": "Alhamdulillahi alladhi bi ni’matihi tatimmus-salihat",
      "turkishTranslation": "Nimetleriyle iyilikler tamamlanan Allah'a hamd olsun.",
      "updated": "2025-05-08 19:11:18.361Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْنِي مِنَ الشَّاكِرِينَ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.365Z",
      "englishTranslation": "O Allah, make me among the grateful.",
      "germanTranslation": "O Allah, mache mich zu den Dankbaren.",
      "id": "kdigd5su25c26dn",
      "source": "General Dua",
      "transliteration": "Allahummaj’alni minash-shakirin",
      "turkishTranslation": "Allah'ım, beni şükredenlerden eyle.",
      "updated": "2025-05-08 19:11:18.365Z"
    },
    {
      "arabicText": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.369Z",
      "englishTranslation": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve.",
      "germanTranslation": "Mein Herr, gib mir ein, für Deine Gunst dankbar zu sein, die Du mir und meinen Eltern erwiesen hast, und rechtschaffene Werke zu tun, mit denen Du zufrieden bist.",
      "id": "9y3g120mek2v18n",
      "source": "Surah An-Naml 27:19",
      "transliteration": "Rabbi awzi’ni an ashkura ni’mataka allati an’amta ‘alayya wa ‘ala walidayya wa an a’mala salihan tardahu",
      "turkishTranslation": "Rabbim, bana ve anne babama verdiğin nimetine şükretmemi ve senin razı olacağın salih ameller işlememi nasip et.",
      "updated": "2025-05-08 19:11:18.369Z"
    },
    {
      "arabicText": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.372Z",
      "englishTranslation": "O Allah, whatever blessing I or any of Your creation have received in the morning is from You alone, with no partner. To You alone is all praise and gratitude.",
      "germanTranslation": "O Allah, was für eine Gunst mir oder irgendeinem Deiner Geschöpfe am Morgen zuteilwird, kommt von Dir allein, Du hast keinen Partner. Dir allein gebührt Lob und Dank.",
      "id": "o5p9hqf2zxe53rh",
      "source": "Sunan Abi Dawud 5073",
      "transliteration": "Allahumma ma asbaha bi min ni’matin aw bi ahadin min khalqika fa minka wahdaka la sharika laka, falakal-hamdu wa lakash-shukr",
      "turkishTranslation": "Allah'ım, sabah bana veya senin yarattıklarından herhangi birine ulaşan her nimet yalnızca sendendir, senin ortağın yoktur. Hamd ve şükür sana mahsustur.",
      "updated": "2025-05-08 19:11:18.372Z"
    },
    {
      "arabicText": "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.376Z",
      "englishTranslation": "All praise is due to Allah, abundant, pure, and blessed praise.",
      "germanTranslation": "Alles Lob gebührt Allah, reichlich, rein und gesegnet.",
      "id": "3bjqcme67q67393",
      "source": "Sahih Muslim 773",
      "transliteration": "Alhamdulillahi hamdan kathiran tayyiban mubarakan fih",
      "turkishTranslation": "Çokça, temiz ve bereketli bir hamd Allah'a mahsustur.",
      "updated": "2025-05-08 19:11:18.376Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.380Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "zxb2exiy3n6cyo2",
      "source": "Sahih Muslim 2721",
      "transliteration": "Allahumma inni as’alukal-huda wat-tuqa wal-‘afafa wal-ghina",
      "turkishTranslation": "Allah'ım, senden hidayet, takva, iffet ve zenginlik diliyorum.",
      "updated": "2025-05-08 19:11:18.380Z"
    },
    {
      "arabicText": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.384Z",
      "englishTranslation": "Glory be to Allah, all praise is due to Allah, there is no god but Allah, and Allah is the Greatest.",
      "germanTranslation": "Preis sei Allah, alles Lob gebührt Allah, es gibt keinen Gott außer Allah, und Allah ist der Größte.",
      "id": "96711y73i32u5u4",
      "source": "General Dhikr",
      "transliteration": "Subhanallahi walhamdulillahi wa la ilaha illallahu wallahu akbar",
      "turkishTranslation": "Allah'ı tesbih ederim, hamd Allah'a mahsustur, Allah'tan başka ilah yoktur ve Allah en büyüktür.",
      "updated": "2025-05-08 19:11:18.384Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.387Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the change in Your protection, the suddenness of Your punishment, and all forms of Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir davor, dass Deine Gaben schwinden, Dein Schutz sich ändert, Deine Strafe plötzlich kommt und vor allem, was Deinen Zorn erregt.",
      "id": "9sswls86e6rhg25",
      "source": "Sahih Muslim 2739",
      "transliteration": "Allahumma inni a’udhu bika min zawali ni’matika wa tahawwuli ‘afiyatika wa fuja’ati niqmatika wa jami’i sakhatika",
      "turkishTranslation": "Allah'ım, nimetlerinin yok olmasından, afiyetinin değişmesinden, cezanın ansızın gelmesinden ve bütün gazabından sana sığınırım.",
      "updated": "2025-05-08 19:11:18.387Z"
    },
    {
      "arabicText": "الْحَمْدُ لِلَّهِ رَبِّ العَالَمِينَ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.390Z",
      "englishTranslation": "All praise is due to Allah, the Lord of the worlds.",
      "germanTranslation": "Alles Lob gebührt Allah, dem Herrn der Welten.",
      "id": "166712g29u6s81l",
      "source": "Surah Al-Fatihah 1:2",
      "transliteration": "Alhamdulillahi rabbil ‘alamin",
      "turkishTranslation": "Hamd, alemlerin Rabbi olan Allah'a mahsustur.",
      "updated": "2025-05-08 19:11:18.390Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلامَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالفَوْزَ بِالجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.392Z",
      "englishTranslation": "O Allah, I ask You for the causes of Your mercy, the certainty of Your forgiveness, safety from every sin, the benefit of every good deed, success in attaining Paradise, and salvation from the Fire.",
      "germanTranslation": "O Allah, ich bitte Dich um die Gründe Deiner Barmherzigkeit, die Gewissheit Deiner Vergebung, Sicherheit vor jeder Sünde, den Nutzen jeder guten Tat, den Erfolg, das Paradies zu erlangen, und die Rettung vor dem Feuer.",
      "id": "u9mso8uv46wnbyx",
      "source": "Sahih Ibn Hibban 2401",
      "transliteration": "Allahumma inni as’aluka mawjibati rahmatika wa ‘aza’ima maghfiratika was-salamata min kulli ithmin wal-ghanimata min kulli birrin wal-fawza bil-jannati wan-najata minan-nar",
      "turkishTranslation": "Allah'ım, senden rahmetinin sebeplerini, bağışlamanın kesinliğini, her günahtan korunmayı, her iyiliğin faydasını, cenneti kazanmayı ve ateşten kurtulmayı diliyorum.",
      "updated": "2025-05-08 19:11:18.392Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الخَيْرَاتِ وَتَرْكَ المُنْكَرَاتِ وَحُبَّ المَسَاكِينِ وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.399Z",
      "englishTranslation": "O Allah, I ask You to enable me to do good deeds, abandon evil deeds, love the poor, and that You forgive me and have mercy on me.",
      "germanTranslation": "O Allah, ich bitte Dich darum, gute Taten zu vollbringen, Schlechtes zu unterlassen, die Armen zu lieben und dass Du mir vergibst und Dich meiner erbarmst.",
      "id": "7jy25mgf16mgu8e",
      "source": "Sunan At-Tirmidhi 3233",
      "transliteration": "Allahumma inni as’aluka fi’lal-khayrati wa tarkal-munkarati wa hubbal-masakin wa an taghfira li wa tarhamani",
      "turkishTranslation": "Allah'ım, senden hayırlı işler yapmayı, kötülükleri terk etmeyi, fakirleri sevmeyi, beni bağışlamanı ve bana merhamet etmeni diliyorum.",
      "updated": "2025-05-08 19:11:18.399Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَالحَزَنِ وَالعَجْزِ وَالكَسَلِ وَالبُخْلِ وَالجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.403Z",
      "englishTranslation": "O Allah, I seek refuge in You from anxiety, grief, weakness, laziness, miserliness, cowardice, the burden of debt, and the domination of men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer, Trauer, Schwäche, Faulheit, Geiz, Feigheit, Schuldenlast und der Unterdrückung durch andere.",
      "id": "n0bp5vlzetijtyw",
      "source": "Sahih Bukhari 6369",
      "transliteration": "Allahumma inni a’udhu bika minal-hammi wal-hazani wal-‘ajzi wal-kasali wal-bukhli wal-jubni wa dala’id-dayni wa ghalabatir-rijal",
      "turkishTranslation": "Allah'ım, senden endişeden, üzüntüden, acizlikten, tembellikten, cimrilikten, korkaklıktan, borç yükünden ve insanların baskısından sana sığınırım.",
      "updated": "2025-05-08 19:11:18.403Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.405Z",
      "englishTranslation": "Our Lord, grant us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.",
      "germanTranslation": "Unser Herr, gib uns im Diesseits Gutes und im Jenseits Gutes und bewahre uns vor der Strafe des Feuers.",
      "id": "06p6pv56a5pd1r8",
      "source": "Surah Al-Baqarah 2:201",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina ‘adhaban-nar",
      "turkishTranslation": "Rabbimiz, bize dünyada ve ahirette iyilik ver ve bizi ateşin azabından koru.",
      "updated": "2025-05-08 19:11:18.405Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.407Z",
      "englishTranslation": "O Allah, I ask You for well-being in this world and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Wohlergehen im Diesseits und im Jenseits.",
      "id": "m2yb96j39b21g6v",
      "source": "Sunan Ibn Majah 3871",
      "transliteration": "Allahumma inni as’alukal-‘afiyata fid-dunya wal-akhirah",
      "turkishTranslation": "Allah'ım, senden dünya ve ahirette afiyet diliyorum.",
      "updated": "2025-05-08 19:11:18.407Z"
    },
    {
      "arabicText": "اللَّهُمَّ مَا قَصُرَ عَنْهُ رَأْيِي وَضَعُفَ عَنْهُ عَمَلِي وَلَمْ تَنْتَهِ إِلَيْهِ رَغْبَتِي وَلَمْ تَبْلُغْهُ مَسْأَلَتِي مِنْ خَيْرٍ وَعَدْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوْ خَيْرٍ أَنْتَ مُعْطِيهِ أَحَدًا مِنْ عِبَادِكَ فَإِنِّي أَرْغَبُ إِلَيْكَ فِيهِ وَأَسْأَلُكَهُ يَا رَبَّ العَالَمِينَ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.410Z",
      "englishTranslation": "O Allah, whatever good my opinion falls short of, my actions are too weak for, my desire does not reach, and my request does not attain—whether it is good You have promised to any of Your creation or good You give to any of Your servants—then I eagerly seek it from You and ask You for it, O Lord of the worlds.",
      "germanTranslation": "O Allah, was für Gutes mein Verstand nicht erfassen kann, meine Taten nicht erreichen, mein Verlangen nicht anstrebt und meine Bitte nicht umfasst—ob es Gutes ist, das Du irgendeinem Deiner Geschöpfe versprochen hast oder Gutes, das Du irgendeinem Deiner Diener gibst—so begehre ich es von Dir und bitte Dich darum, o Herr der Welten.",
      "id": "9hk8301t6e49x4h",
      "source": "Sahih Ibn Hibban 2405",
      "transliteration": "Allahumma ma qasura ‘anhu ra’yi wa da’ufa ‘anhu ‘amali wa lam tantahi ilayhi raghbati wa lam tablughhu mas’alati min khayrin wa’adtahu ahadan min khalqika aw khayrin anta mu’tihi ahadan min ‘ibadika fa inni arghabu ilayka fihi wa as’alukahu ya rabbal-‘alamin",
      "turkishTranslation": "Allah'ım, aklımın yetişemediği, amelimin güç yetiremediği, arzumun ulaşamadığı ve dileğimin erişemediği her hayır—ister yaratıklarından birine vaat ettiğin, ister kullarından birine verdiğin—işte ben onu senden isterim, ey alemlerin Rabbi!",
      "updated": "2025-05-08 19:11:18.410Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ اليُسْرَ وَالعَافِيَةَ وَأَعُوذُ بِكَ مِنَ العُسْرِ وَالشَّقَاءِ وَالهَلَكَةِ وَالفَقْرِ وَالفَاقَةِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.413Z",
      "englishTranslation": "O Allah, I ask You for ease and well-being, and I seek refuge in You from hardship, misery, destruction, poverty, and need.",
      "germanTranslation": "O Allah, ich bitte Dich um Erleichterung und Wohlergehen und suche Zuflucht bei Dir vor Schwierigkeiten, Elend, Untergang, Armut und Not.",
      "id": "55x4290q554r0z6",
      "source": "Musnad Ahmad 15419",
      "transliteration": "Allahumma inni as’alukal-yusra wal-‘afiyata wa a’udhu bika minal-‘usri wash-shaqa’i wal-halikati wal-faqri wal-faqah",
      "turkishTranslation": "Allah'ım, senden kolaylık ve afiyet diliyorum, zorluktan, sıkıntıdan, helakten, fakirlikten ve ihtiyaçtan sana sığınırım.",
      "updated": "2025-05-08 19:11:18.413Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.415Z",
      "englishTranslation": "O Allah, I ask You for all that is good, in this world and the next, what I know of it and what I do not know. And I seek refuge in You from all that is evil, in this world and the next, what I know of it and what I do not know.",
      "germanTranslation": "O Allah, ich bitte Dich um alles Gute, im Diesseits und Jenseits, was ich davon weiß und was ich nicht weiß. Und ich suche Zuflucht bei Dir vor allem Bösen, im Diesseits und Jenseits, was ich davon weiß und was ich nicht weiß.",
      "id": "9aq62971s1fv302",
      "source": "Sunan Ibn Majah 3846",
      "transliteration": "Allahumma inni as’aluka minal-khayri kullihi ‘ajilihi wa ajilihi ma ‘alimtu minhu wa ma lam a’lam, wa a’udhu bika minash-sharri kullihi ‘ajilihi wa ajilihi ma ‘alimtu minhu wa ma lam a’lam",
      "turkishTranslation": "Allah'ım, senden bütün hayırları diliyorum, dünya ve ahirette, bildiğim ve bilmediğim. Ve bütün şerlerden sana sığınıyorum, dünya ve ahirette, bildiğim ve bilmediğim.",
      "updated": "2025-05-08 19:11:18.415Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.418Z",
      "englishTranslation": "O Allah, I ask You for Your pleasure and Paradise, and I seek refuge in You from Your displeasure and the Fire.",
      "germanTranslation": "O Allah, ich bitte Dich um Dein Wohlgefallen und das Paradies, und ich suche Zuflucht bei Dir vor Deinem Zorn und dem Feuer.",
      "id": "yj4ove39k2sb5lg",
      "source": "Sunan At-Tirmidhi 2487",
      "transliteration": "Allahumma inni as’aluka ridaka wal-jannata wa a’udhu bika min sakhatika wan-nar",
      "turkishTranslation": "Allah'ım, senden rızanı ve cenneti diliyorum, gazabından ve ateşten sana sığınırım.",
      "updated": "2025-05-08 19:11:18.418Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ فِي الدِّينِ وَالدُّنْيَا وَالآخِرَةِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.420Z",
      "englishTranslation": "O Allah, I ask You for pardon and well-being in my religion, my worldly life, and my Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Vergebung und Wohlergehen in meiner Religion, meinem weltlichen Leben und meinem Jenseits.",
      "id": "49n4223pgn4e2i0",
      "source": "Sunan Abi Dawud 5074",
      "transliteration": "Allahumma inni as’alukal-‘afwa wal-‘afiyata fid-dini wad-dunya wal-akhirah",
      "turkishTranslation": "Allah'ım, senden dinimde, dünyamda ve ahiretimde af ve afiyet diliyorum.",
      "updated": "2025-05-08 19:11:18.420Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الفَوزَ يَوْمَ القَضَاءِ وَعَيْشَ السُّعَدَاءِ وَمُرَافَقَةَ الأَنبِيَاءِ وَالنَّصْرَ عَلَى الأَعْدَاءِ",
      "category": "Gratitude",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:18.422Z",
      "englishTranslation": "O Allah, I ask You for success on the Day of Judgment, the life of the blessed, the companionship of the prophets, and victory over enemies.",
      "germanTranslation": "O Allah, ich bitte Dich um Erfolg am Tag des Gerichts, das Leben der Glücklichen, die Gemeinschaft der Propheten und den Sieg über die Feinde.",
      "id": "y796cj4w8162w7j",
      "source": "Shu’ab Al-Iman 1053",
      "transliteration": "Allahumma inni as’alukal-fawza yaumal-qada’i wa ‘ayshas-su’ada’i wa murafaqatal-anbiya’i wan-nasra ‘alal-a’da’",
      "turkishTranslation": "Allah'ım, senden kıyamet gününde kurtuluşu, mutluların hayatını, peygamberlerle beraberliği ve düşmanlara karşı zafer diliyorum.",
      "updated": "2025-05-08 19:11:18.422Z"
    },
    {
      "arabicText": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.315Z",
      "englishTranslation": "Our Lord, pour upon us patience and make our steps firm and give us victory over the disbelieving people.",
      "germanTranslation": "Unser Herr, gieße Geduld über uns aus, festige unsere Schritte und hilf uns gegen das ungläubige Volk.",
      "id": "s6cduy8h681878k",
      "source": "Surah Al-Baqarah (2:250)",
      "transliteration": "Rabbana afrigh 'alayna sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin",
      "turkishTranslation": "Rabbimiz, üzerimize sabır yağdır, ayaklarımızı sabit kıl ve bizi kâfirler topluluğuna karşı yardımınla muzaffer kıl.",
      "updated": "2025-05-08 19:11:33.315Z"
    },
    {
      "arabicText": "حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.320Z",
      "englishTranslation": "Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne.",
      "germanTranslation": "Allah genügt mir. Es gibt keinen Gott außer Ihm. Auf Ihn verlasse ich mich, und Er ist der Herr des gewaltigen Thrones.",
      "id": "04n5qd58l81wuu5",
      "source": "Surah At-Tawbah (9:129)",
      "transliteration": "Hasbiyallahu la ilaha illa huwa, 'alayhi tawakkaltu wa huwa Rabbul-'arshil-'azim",
      "turkishTranslation": "Allah bana yeter, O'ndan başka ilah yoktur. Ben yalnız O'na güvenirim. O, büyük Arş'ın Rabbidir.",
      "updated": "2025-05-08 19:11:33.320Z"
    },
    {
      "arabicText": "رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.323Z",
      "englishTranslation": "My Lord, indeed I am, for whatever good You would send down to me, in need.",
      "germanTranslation": "Mein Herr, ich bin bedürftig für das Gute, das Du zu mir herabsendest.",
      "id": "9h0fo212een2tp8",
      "source": "Surah Al-Qasas (28:24)",
      "transliteration": "Rabbi inni lima anzalta ilayya min khayrin faqir",
      "turkishTranslation": "Rabbim, bana indireceğin her hayra muhtacım.",
      "updated": "2025-05-08 19:11:33.323Z"
    },
    {
      "arabicText": "لَا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.326Z",
      "englishTranslation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
      "germanTranslation": "Es gibt keinen Gott außer Dir. Preis sei Dir! Ich war wahrlich einer der Ungerechten.",
      "id": "fk1x08aurp9symn",
      "source": "Surah Al-Anbiya (21:87)",
      "transliteration": "La ilaha illa anta subhanaka inni kuntu minaz-zalimin",
      "turkishTranslation": "Senden başka ilah yoktur. Seni eksikliklerden uzak tutarım. Ben gerçekten zalimlerden oldum.",
      "updated": "2025-05-08 19:11:33.326Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.329Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sadness, from weakness and laziness, from miserliness and cowardice, from being overcome by debt and overpowered by men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Trauer, vor Schwäche und Faulheit, vor Geiz und Feigheit, vor Schuldenlast und der Unterdrückung durch Menschen.",
      "id": "od9m6iz30257tb5",
      "source": "Sahih Bukhari (6369)",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'id-dayn wa ghalabatir-rijal",
      "turkishTranslation": "Allah'ım! Kederden, üzüntüden, acizlikten, tembellikten, cimrilikten, korkaklıktan, borç yükünden ve insanların baskısından sana sığınırım.",
      "updated": "2025-05-08 19:11:33.329Z"
    },
    {
      "arabicText": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.332Z",
      "englishTranslation": "My Lord, expand for me my breast [with assurance], ease for me my task, and untie the knot from my tongue that they may understand my speech.",
      "germanTranslation": "Mein Herr, weite mir meine Brust, erleichtere mir meine Aufgabe und löse den Knoten meiner Zunge, damit sie meine Rede verstehen.",
      "id": "85lx9pzj5m7ux42",
      "source": "Surah Ta-Ha (20:25-28)",
      "transliteration": "Rabbi ishrah li sadri wa yassir li amri wahlul 'uqdatan min lisan yafqahu qawli",
      "turkishTranslation": "Rabbim! Gönlüme ferahlık ver, işimi kolaylaştır, dilimdeki tutukluğu çöz ki sözümü anlasınlar.",
      "updated": "2025-05-08 19:11:33.332Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.335Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "vrp26qocel04i23",
      "source": "Sahih Muslim (2721)",
      "transliteration": "Allahumma inni as'alukal-huda wat-tuqa wal-'afafa wal-ghina",
      "turkishTranslation": "Allah'ım! Senden hidayet, takva, iffet ve gönül zenginliği istiyorum.",
      "updated": "2025-05-08 19:11:33.335Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْنِي صَبَّارًا وَاجْعَلْنِي شَكَّارًا",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.339Z",
      "englishTranslation": "O Allah, make me patient and make me grateful.",
      "germanTranslation": "O Allah, mache mich geduldig und dankbar.",
      "id": "9c5g8h764864u77",
      "source": "Sunan At-Tirmidhi (3484)",
      "transliteration": "Allahummaj'alni sabbaran waj'alni shakkar",
      "turkishTranslation": "Allah'ım! Beni sabırlı ve şükreden bir kul eyle.",
      "updated": "2025-05-08 19:11:33.339Z"
    },
    {
      "arabicText": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.343Z",
      "englishTranslation": "Glory is to Allah and praise is to Him, Glory is to Allah the Almighty.",
      "germanTranslation": "Preis sei Allah und Lob sei Ihm, Preis sei Allah, dem Allmächtigen.",
      "id": "y89rn8ep4c1b49z",
      "source": "Sahih Bukhari (6682)",
      "transliteration": "Subhanallahi wa bihamdihi, subhanallahil-'azim",
      "turkishTranslation": "Allah'ı hamd ile tesbih ederim, Yüce Allah'ı tesbih ederim.",
      "updated": "2025-05-08 19:11:33.343Z"
    },
    {
      "arabicText": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.346Z",
      "englishTranslation": "There is no power nor strength except with Allah.",
      "germanTranslation": "Es gibt keine Macht und keine Kraft außer durch Allah.",
      "id": "q99lqtjs108p91f",
      "source": "Sahih Bukhari (6384)",
      "transliteration": "La hawla wa la quwwata illa billah",
      "turkishTranslation": "Güç ve kuvvet ancak Allah'ın yardımıyla vardır.",
      "updated": "2025-05-08 19:11:33.346Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.351Z",
      "englishTranslation": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
      "germanTranslation": "Unser Herr, gib uns im Diesseits Gutes und im Jenseits Gutes und bewahre uns vor der Strafe des Feuers.",
      "id": "d2gj9f5641sms11",
      "source": "Surah Al-Baqarah (2:201)",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar",
      "turkishTranslation": "Rabbimiz! Bize dünyada da iyilik ver, ahirette de iyilik ver. Bizi ateş azabından koru.",
      "updated": "2025-05-08 19:11:33.351Z"
    },
        {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.354Z",
      "englishTranslation": "O Allah, I seek refuge in You from the withdrawal of Your blessing, the change of Your protection, the suddenness of Your punishment, and all Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor dem Entzug Deiner Gnade, der Veränderung Deines Schutzes, der Plötzlichkeit Deiner Strafe und allem, was Deinen Zorn erregt.",
      "id": "3ynw318wwt391qz",
      "source": "Sahih Muslim (2739)",
      "transliteration": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik",
      "turkishTranslation": "Allah'ım! Nimetinin gitmesinden, afiyetinin değişmesinden, ansızın vereceğin cezadan ve bütün gazabından sana sığınırım.",
      "updated": "2025-05-08 19:11:33.354Z"
    },
    {
      "arabicText": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.357Z",
      "englishTranslation": "O Ever-Living, O Sustainer, by Your mercy I seek help.",
      "germanTranslation": "O Ewiglebender, O Allerhalter, durch Deine Barmherzigkeit bitte ich um Hilfe.",
      "id": "5voi321bd8jlaj2",
      "source": "Sunan At-Tirmidhi (3524)",
      "transliteration": "Ya Hayyu Ya Qayyum birahmatika astaghith",
      "turkishTranslation": "Ey Hayy ve Kayyum olan Allah'ım! Rahmetine sığınırım.",
      "updated": "2025-05-08 19:11:33.357Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الصَّبْرَ عَلَى قَضَائِكَ وَالرِّضَا بِقَدَرِكَ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.359Z",
      "englishTranslation": "O Allah, I ask You for patience with Your decree and contentment with Your decree.",
      "germanTranslation": "O Allah, ich bitte Dich um Geduld mit Deinem Beschluss und Zufriedenheit mit Deiner Vorherbestimmung.",
      "id": "ks54n53e3827m4j",
      "source": "Musnad Ahmad (22896)",
      "transliteration": "Allahumma inni as'alukas-sabra 'ala qada'ik war-rida biqadarik",
      "turkishTranslation": "Allah'ım! Senden hükmüne sabır ve kaderine razı olmayı istiyorum.",
      "updated": "2025-05-08 19:11:33.359Z"
    },
    {
      "arabicText": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.361Z",
      "englishTranslation": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.",
      "germanTranslation": "Mein Herr, gib mir ein, für Deine Gnade zu danken, die Du mir und meinen Eltern erwiesen hast, und rechtschaffene Werke zu tun, die Dir gefallen. Und nimm mich durch Deine Barmherzigkeit unter Deine rechtschaffenen Diener auf.",
      "id": "p7z837rz61c1588",
      "source": "Surah Al-Ahqaf (46:15)",
      "transliteration": "Rabbi awzi'ni an ashkura ni'matakallati an'amta 'alayya wa 'ala walidayya wa an a'mala salihan tardahu wa aslih li fi dhurriyyati",
      "turkishTranslation": "Rabbim! Bana ve ana-babama verdiğin nimete şükretmemi, hoşnut olacağın salih ameller işlememi nasip et. Benim için de zürriyetim için de ıslah eyle.",
      "updated": "2025-05-08 19:11:33.361Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِيَ الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِن كُلِّ شَرٍّ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.364Z",
      "englishTranslation": "O Allah, rectify for me my religion which is the safeguard of my affairs, rectify for me my worldly life in which is my livelihood, and rectify for me my Hereafter to which is my return. Make life for me an increase in every good and make death for me a relief from every evil.",
      "germanTranslation": "O Allah, korrigiere für mich meine Religion, die der Schutz meiner Angelegenheiten ist, korrigiere für mich mein Diesseits, in dem mein Lebensunterhalt liegt, und korrigiere für mich mein Jenseits, zu dem meine Rückkehr ist. Mache das Leben für mich zu einer Zunahme an allem Guten und mache den Tod für mich zu einer Erleichterung von allem Übel.",
      "id": "gi754c9wd5e3yuw",
      "source": "Sahih Muslim (2720)",
      "transliteration": "Allahumma aslih li diniyalladhi huwa 'ismatu amri, wa aslih li dunyaya allati fiha ma'ashi, wa aslih li akhirati allati fiha ma'adi, waj'alil-hayata ziyadatan li fi kulli khayr, waj'alil-mawta rahatan li min kulli sharr",
      "turkishTranslation": "Allah'ım! İşlerimin koruyucusu olan dinimi, geçim kaynağım olan dünyamı ve dönüş yerim olan ahiretimi ıslah eyle. Hayatımı her hayır için bir artış, ölümümü de her şerden bir kurtuluş eyle.",
      "updated": "2025-05-08 19:11:33.364Z"
    },
    {
      "arabicText": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.367Z",
      "englishTranslation": "Our Lord, do not impose blame upon us if we have forgotten or erred.",
      "germanTranslation": "Unser Herr, belange uns nicht, wenn wir vergessen oder einen Fehler begehen.",
      "id": "590ie4al9o413j7",
      "source": "Surah Al-Baqarah (2:286)",
      "transliteration": "Rabbana la tu'akhidhna in nasina aw akhta'na",
      "turkishTranslation": "Rabbimiz! Unuttuk ya da yanıldıysak bizi hesaba çekme.",
      "updated": "2025-05-08 19:11:33.367Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ البَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ القَضَاءِ وَشَمَاتَةِ الأَعْدَاءِ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.369Z",
      "englishTranslation": "O Allah, I seek refuge in You from the severity of trials, the depths of misery, evil decrees, and the gloating of enemies.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor der Härte der Prüfungen, der Tiefe des Elends, schlechter Vorherbestimmung und dem Hohn der Feinde.",
      "id": "3nv0xmhnw4452it",
      "source": "Sahih Bukhari (6347)",
      "transliteration": "Allahumma inni a'udhu bika min jahdil-bala'i wa darakish-shaqa'i wa su'il-qada'i wa shamatatil-a'da'i",
      "turkishTranslation": "Allah'ım! Şiddetli belalardan, derin sıkıntılardan, kötü kazalardan ve düşmanların sevinmesinden sana sığınırım.",
      "updated": "2025-05-08 19:11:33.369Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلًا",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.371Z",
      "englishTranslation": "O Allah, I ask You for beneficial knowledge, wholesome provision, and accepted deeds.",
      "germanTranslation": "O Allah, ich bitte Dich um nützliches Wissen, guten Lebensunterhalt und angenommene Taten.",
      "id": "vbryci48ceyf63y",
      "source": "Sunan Ibn Majah (925)",
      "transliteration": "Allahumma inni as'aluka 'ilman nafi'an wa rizqan tayyiban wa 'amalan mutaqabbalan",
      "turkishTranslation": "Allah'ım! Senden faydalı ilim, helal rızık ve kabul edilen amel istiyorum.",
      "updated": "2025-05-08 19:11:33.371Z"
    },
    {
      "arabicText": "حَسْبُنَا اللَّهُ وَنِعْمَ الوَكِيلُ",
      "category": "Patience",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:11:33.373Z",
      "englishTranslation": "Sufficient for us is Allah, and [He is] the best Disposer of affairs.",
      "germanTranslation": "Allah genügt uns, und Er ist der beste Anwalt.",
      "id": "o53g73ooz47u3v2",
      "source": "Surah Al-Imran (3:173)",
      "transliteration": "Hasbunallahu wa ni'mal-wakil",
      "turkishTranslation": "Allah bize yeter, O ne güzel vekildir.",
      "updated": "2025-05-08 19:11:33.373Z"
    },
    {
      "arabicText": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.386Z",
      "englishTranslation": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.",
      "germanTranslation": "Unser Herr, schenke uns aus unseren Gattinnen und Nachkommen Augentrost und mache uns zu einem Vorbild für die Gottesfürchtigen.",
      "id": "pddljha9r76sd2z",
      "source": "Quran 25:74",
      "transliteration": "Rabbana hab lana min azwajina wa dhurriyyatina qurrata a'yunin waj'alna lil-muttaqina imama.",
      "turkishTranslation": "Rabbimiz, bize eşlerimizden ve çocuklarımızdan göz aydınlığı olacak kimseler bağışla ve bizi takva sahiplerine önder kıl.",
      "updated": "2025-05-08 19:17:11.386Z"
    },
    {
      "arabicText": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.393Z",
      "englishTranslation": "My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, accept my supplication.",
      "germanTranslation": "Mein Herr, mache mich und einen Teil meiner Nachkommen zu denen, die das Gebet verrichten. Unser Herr, nimm mein Bittgebet an.",
      "id": "lcwh4624gp0y8q4",
      "source": "Quran 14:40",
      "transliteration": "Rabbij-'alni muqimas-salati wa min dhurriyyati, Rabbana wa taqabbal du'a.",
      "turkishTranslation": "Rabbim, beni namazı dosdoğru kılanlardan eyle, soyumdan da. Rabbimiz, duamı kabul et.",
      "updated": "2025-05-08 19:17:11.393Z"
    },
    {
      "arabicText": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.397Z",
      "englishTranslation": "My Lord, grant me [a child] from among the righteous.",
      "germanTranslation": "Mein Herr, schenke mir einen rechtschaffenen (Nachkommen).",
      "id": "9x0r90lnrhqbu24",
      "source": "Quran 37:100",
      "transliteration": "Rabbi hab li minas-salihin.",
      "turkishTranslation": "Rabbim, bana salihlerden (bir evlat) ihsan eyle.",
      "updated": "2025-05-08 19:17:11.397Z"
    },
    {
      "arabicText": "اللَّهُمَّ بَارِكْ لِي فِي أَهْلِي وَمَالِي",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.400Z",
      "englishTranslation": "O Allah, bless me in my family and my wealth.",
      "germanTranslation": "O Allah, segne mich in meiner Familie und meinem Besitz.",
      "id": "953583sj7302r0e",
      "source": "Sunan Ibn Majah 925",
      "transliteration": "Allahumma barik li fi ahli wa mali.",
      "turkishTranslation": "Allah'ım, aileme ve malıma bereket ver.",
      "updated": "2025-05-08 19:17:11.400Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي فِي ذُرِّيَّتِي",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.404Z",
      "englishTranslation": "O Allah, rectify for me my offspring.",
      "germanTranslation": "O Allah, mache meine Nachkommen rechtschaffen für mich.",
      "id": "00vmamwqbn46w2i",
      "source": "Musnad Ahmad 15577",
      "transliteration": "Allahumma aslih li fi dhurriyyati.",
      "turkishTranslation": "Allah'ım, neslimi benim için ıslah eyle.",
      "updated": "2025-05-08 19:17:11.404Z"
    },
    {
      "arabicText": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.407Z",
      "englishTranslation": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And make righteous for me my offspring.",
      "germanTranslation": "Mein Herr, gib mir ein, dass ich dankbar sei für Deine Gnade, die Du mir und meinen Eltern erwiesen hast, und dass ich rechtschaffen handle, mit dem Du zufrieden bist. Und mache meine Nachkommen rechtschaffen für mich.",
      "id": "p05n5h7082b92lr",
      "source": "Quran 46:15",
      "transliteration": "Rabbi awzi'ni an ashkura ni'matakallati an'amta 'alayya wa 'ala walidayya wa an a'mala salihan tardahu wa aslih li fi dhurriyyati.",
      "turkishTranslation": "Rabbim, bana ve anne-babama verdiğin nimetine şükretmemi ve razı olacağın salih ameller işlememi nasip et. Neslimi de benim için ıslah eyle.",
      "updated": "2025-05-08 19:17:11.407Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ ذُرِّيَّةً طَيِّبَةً",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.409Z",
      "englishTranslation": "O Allah, I ask You for good offspring.",
      "germanTranslation": "O Allah, ich bitte Dich um rechtschaffene Nachkommen.",
      "id": "5sa2e90b6308xey",
      "source": "Sunan Ibn Majah 925",
      "transliteration": "Allahumma inni as'aluka dhurriyyatan tayyibatan.",
      "turkishTranslation": "Allah'ım, senden salih bir nesil diliyorum.",
      "updated": "2025-05-08 19:17:11.409Z"
    },
    {
      "arabicText": "رَبِّ اجْعَلْنِي وَذُرِّيَّتِي مِنَ الْمُقِيمِينَ الصَّلَاةِ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.413Z",
      "englishTranslation": "My Lord, make me and my descendants establishers of prayer.",
      "germanTranslation": "Mein Herr, mache mich und meine Nachkommen zu denen, die das Gebet verrichten.",
      "id": "7nc591v4eojhww4",
      "source": "Quran 14:40 (similar)",
      "transliteration": "Rabbij-'alni wa dhurriyyati minal-muqiminas-salati.",
      "turkishTranslation": "Rabbim, beni ve soyumu namazı dosdoğru kılanlardan eyle.",
      "updated": "2025-05-08 19:17:11.413Z"
    },
    {
      "arabicText": "اللَّهُمَّ ارْزُقْنِي الْوَلَدَ الصَّالِحَ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.417Z",
      "englishTranslation": "O Allah, grant me a righteous child.",
      "germanTranslation": "O Allah, gewähre mir ein rechtschaffenes Kind.",
      "id": "s2pf4622f89jab3",
      "source": "General Dua",
      "transliteration": "Allahummarzuqnil-waladas-saliha.",
      "turkishTranslation": "Allah'ım, bana salih bir evlat nasip et.",
      "updated": "2025-05-08 19:17:11.417Z"
    },
    {
      "arabicText": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.420Z",
      "englishTranslation": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.",
      "germanTranslation": "Mein Herr, schenke mir aus Deiner Gnade eine gute Nachkommenschaft. Wahrlich, Du bist der Hörende der Bitte.",
      "id": "g06sd0a6hl41t60",
      "source": "Quran 3:38",
      "transliteration": "Rabbi hab li min ladunka dhurriyyatan tayyibatan innaka sami'ud-du'a.",
      "turkishTranslation": "Rabbim, bana katından temiz bir nesil bağışla. Şüphesiz Sen duayı işitensin.",
      "updated": "2025-05-08 19:17:11.420Z"
    },
    {
      "arabicText": "اللَّهُمَّ وَفِّقْ أَوْلَادِي لِطَاعَتِكَ وَاحْفَظْهُمْ مِنَ الشَّيْطَانِ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.426Z",
      "englishTranslation": "O Allah, make my children obedient to You and protect them from Satan.",
      "germanTranslation": "O Allah, lasse meine Kinder Dir gehorsam sein und beschütze sie vor Satan.",
      "id": "nwtc2mn86647j60",
      "source": "General Dua",
      "transliteration": "Allahumma waffiq awladi li ta'atika wahfazhum minash-shaytan.",
      "turkishTranslation": "Allah'ım, çocuklarımı sana itaat edenlerden eyle ve onları şeytandan koru.",
      "updated": "2025-05-08 19:17:11.426Z"
    },
    {
      "arabicText": "اللَّهُمَّ احْفَظْ عَائِلَتِي بِحِفْظِكَ وَارْزُقْهُمُ الْعَافِيَةَ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.430Z",
      "englishTranslation": "O Allah, protect my family with Your protection and grant them well-being.",
      "germanTranslation": "O Allah, beschütze meine Familie mit Deinem Schutz und gewähre ihnen Wohlergehen.",
      "id": "a8lud9q07z8y88o",
      "source": "General Dua",
      "transliteration": "Allahummahfaz 'ailati bi hifzika warzuqhumul-'afiyah.",
      "turkishTranslation": "Allah'ım, ailemi korumanla koru ve onlara afiyet nasip et.",
      "updated": "2025-05-08 19:17:11.430Z"
    },
    {
      "arabicText": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.433Z",
      "englishTranslation": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
      "germanTranslation": "Unser Herr, vergib mir und meinen Eltern und den Gläubigen am Tag, an dem die Abrechnung stattfindet.",
      "id": "739j3ay49xj168j",
      "source": "Quran 14:41",
      "transliteration": "Rabbana-ghfir li wa li walidayya wa lil-mu'minina yawma yaqumul-hisab.",
      "turkishTranslation": "Rabbimiz, hesap günü geldiğinde beni, anne-babamı ve müminleri bağışla.",
      "updated": "2025-05-08 19:17:11.433Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ أَزْوَاجَنَا وَذُرِّيَّاتِنَا",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.436Z",
      "englishTranslation": "O Allah, rectify our spouses and our offspring.",
      "germanTranslation": "O Allah, mache unsere Ehepartner und Nachkommen rechtschaffen.",
      "id": "56i9cpivog9rnr4",
      "source": "General Dua",
      "transliteration": "Allahumma aslih azwajana wa dhurriyyatina.",
      "turkishTranslation": "Allah'ım, eşlerimizi ve çocuklarımızı ıslah eyle.",
      "updated": "2025-05-08 19:17:11.436Z"
    },
    {
      "arabicText": "رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.438Z",
      "englishTranslation": "My Lord, have mercy upon them [my parents] as they brought me up [when I was] small.",
      "germanTranslation": "Mein Herr, erbarme Dich ihrer (meiner Eltern), wie sie mich aufgezogen haben, als ich klein war.",
      "id": "2oem04dz683f867",
      "source": "Quran 17:24",
      "transliteration": "Rabbi-rhamhuma kama rabbayani saghira.",
      "turkishTranslation": "Rabbim, onlara (anne-babama) merhamet et, tıpkı beni küçükken yetiştirdikleri gibi.",
      "updated": "2025-05-08 19:17:11.438Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْ أَهْلِي وَأَوْلَادِي مِنَ السَّعِيدِينَ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.440Z",
      "englishTranslation": "O Allah, make my family and my children among the happy ones.",
      "germanTranslation": "O Allah, lasse meine Familie und meine Kinder zu den Glücklichen gehören.",
      "id": "839f4n9pj4e5854",
      "source": "General Dua",
      "transliteration": "Allahummaj-'al ahli wa awladi minas-sa'idin.",
      "turkishTranslation": "Allah'ım, ailemi ve çocuklarımı mutlu olanlardan eyle.",
      "updated": "2025-05-08 19:17:11.440Z"
    },
    {
      "arabicText": "اللَّهُمَّ احْفَظْنِي وَأَهْلِي مِنْ كُلِّ شَرٍّ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.442Z",
      "englishTranslation": "O Allah, protect me and my family from all evil.",
      "germanTranslation": "O Allah, beschütze mich und meine Familie vor allem Übel.",
      "id": "uqdr0bkh67l0a54",
      "source": "General Dua",
      "transliteration": "Allahummahfazni wa ahli min kulli sharrin.",
      "turkishTranslation": "Allah'ım, beni ve ailemi her türlü şerden koru.",
      "updated": "2025-05-08 19:17:11.442Z"
    },
    {
      "arabicText": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْفَظْ لِي أَهْلِي",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.445Z",
      "englishTranslation": "My Lord, expand for me my breast, ease for me my task, and protect for me my family.",
      "germanTranslation": "Mein Herr, weite mir meine Brust, erleichtere mir meine Angelegenheit und beschütze meine Familie für mich.",
      "id": "da6u4538myj98y2",
      "source": "Inspired by Quran 20:25-28",
      "transliteration": "Rabbi-shrah li sadri wa yassir li amri wahfaz li ahli.",
      "turkishTranslation": "Rabbim, göğsümü genişlet, işimi kolaylaştır ve ailemi koru.",
      "updated": "2025-05-08 19:17:11.445Z"
    },
    {
      "arabicText": "اللَّهُمَّ ارْزُقْنِي زَوْجًا صَالِحًا وَذُرِّيَّةً طَيِّبَةً",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.447Z",
      "englishTranslation": "O Allah, grant me a righteous spouse and good offspring.",
      "germanTranslation": "O Allah, gewähre mir einen rechtschaffenen Ehepartner und gute Nachkommen.",
      "id": "rdv274n28489ydp",
      "source": "General Dua",
      "transliteration": "Allahummarzuqni zawjan salihan wa dhurriyyatan tayyibatan.",
      "turkishTranslation": "Allah'ım, bana salih bir eş ve temiz bir nesil nasip et.",
      "updated": "2025-05-08 19:17:11.447Z"
    },
    {
      "arabicText": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ",
      "category": "Family",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:11.449Z",
      "englishTranslation": "Our Lord, accept [this] from us. Indeed, You are the Hearing, the Knowing.",
      "germanTranslation": "Unser Herr, nimm (dies) von uns an. Wahrlich, Du bist der Hörende, der Wissende.",
      "id": "ky7b4404r39f23k",
      "source": "Quran 2:127",
      "transliteration": "Rabbana taqabbal minna innaka Antas-Sami'ul-'Alim.",
      "turkishTranslation": "Rabbimiz, bizden (bu duayı) kabul et. Şüphesiz Sen işitensin, bilensin.",
      "updated": "2025-05-08 19:17:11.449Z"
    },
    {
      "arabicText": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.772Z",
      "englishTranslation": "O Allah, distance me from my sins as You have distanced the east from the west.",
      "germanTranslation": "O Allah, entferne mich von meinen Sünden, so wie Du den Osten vom Westen entfernt hast.",
      "id": "4887geq0v72809s",
      "source": "Sahih al-Bukhari 852",
      "transliteration": "Allahumma bāʿid baynī wa bayna khaṭāyāya kamā bāʿadta bayna al-mashriqi wa al-maghrib.",
      "turkishTranslation": "Allah'ım, beni günahlarımdan uzaklaştır, tıpkı doğu ile batıyı birbirinden uzaklaştırdığın gibi.",
      "updated": "2025-05-08 19:17:36.772Z"
    },
    {
      "arabicText": "اللَّهُمَّ نَقِّنِي مِنَ الخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.776Z",
      "englishTranslation": "O Allah, cleanse me of my sins as a white garment is cleansed of dirt.",
      "germanTranslation": "O Allah, reinige mich von meinen Sünden, wie ein weißes Kleid von Schmutz gereinigt wird.",
      "id": "2x8y6gfy83100n8",
      "source": "Sahih al-Bukhari 852",
      "transliteration": "Allahumma naqqinī min al-khaṭāyā kamā yunaqqā al-thawb al-abyad min al-danas.",
      "turkishTranslation": "Allah'ım, beni günahlarımdan temizle, tıpkı beyaz bir elbisenin kirden temizlendiği gibi.",
      "updated": "2025-05-08 19:17:36.776Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي بَصَرِي نُورًا، وَفِي سَمْعِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَفَوْقِي نُورًا، وَتَحْتِي نُورًا، وَاجْعَلْ لِي نُورًا",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.779Z",
      "englishTranslation": "O Allah, place light in my heart, light in my sight, light in my hearing, light on my right, light on my left, light before me, light behind me, light above me, light below me, and make light for me.",
      "germanTranslation": "O Allah, gib Licht in mein Herz, Licht in meine Augen, Licht in mein Gehör, Licht zu meiner Rechten, Licht zu meiner Linken, Licht vor mir, Licht hinter mir, Licht über mir, Licht unter mir und mache Licht für mich.",
      "id": "9682ma09opvz0sz",
      "source": "Sahih al-Bukhari 6316",
      "transliteration": "Allahumma ijʿal fī qalbī nūran, wa fī baṣarī nūran, wa fī samʿī nūran, wa ʿan yamīnī nūran, wa ʿan shimālī nūran, wa amāmī nūran, wa khalfī nūran, wa fawqī nūran, wa taḥtī nūran, wa ijʿal lī nūran.",
      "turkishTranslation": "Allah'ım, kalbime nur ver, gözüme nur ver, kulağıma nur ver, sağıma nur ver, soluma nur ver, önüme nur ver, arkama nur ver, üstüme nur ver, altıma nur ver ve bana nur ver.",
      "updated": "2025-05-08 19:17:36.779Z"
    },
    {
      "arabicText": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، تَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.783Z",
      "englishTranslation": "Glory be to You, O Allah, and praise be to You. Blessed is Your name, and exalted is Your majesty. There is no god but You.",
      "germanTranslation": "Preis sei Dir, o Allah, und Lob sei Dir. Gesegnet ist Dein Name, und erhaben ist Deine Herrschaft. Es gibt keinen Gott außer Dir.",
      "id": "90ms7l2q9ps9h9r",
      "source": "Sunan Abu Dawud 775",
      "transliteration": "Subḥānaka Allāhumma wa bi-ḥamdika, tabāraka ismuka, wa taʿālā jadduka, wa lā ilāha ghayruk.",
      "turkishTranslation": "Seni eksikliklerden tenzih ederim Allah'ım ve sana hamd ederim. İsmin mübarektir, şanın yücedir. Senden başka ilah yoktur.",
      "updated": "2025-05-08 19:17:36.783Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.786Z",
      "englishTranslation": "O my Lord, forgive me, have mercy on me, guide me, grant me well-being, and provide for me.",
      "germanTranslation": "O mein Herr, vergib mir, erbarme Dich meiner, führe mich, gewähre mir Wohlergehen und versorge mich.",
      "id": "a81ilpi84s5zhw8",
      "source": "Sunan Abu Dawud 850",
      "transliteration": "Rabbighfir lī, warḥamnī, wahdinī, wa ʿāfinī, warzuqnī.",
      "turkishTranslation": "Rabbim, beni bağışla, bana merhamet et, bana hidayet ver, bana afiyet ver ve bana rızık ver.",
      "updated": "2025-05-08 19:17:36.786Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.788Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sorrow, from weakness and laziness, from miserliness and cowardice, from being overwhelmed by debt and overpowered by men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Trauer, vor Schwäche und Faulheit, vor Geiz und Feigheit, vor Schuldenlast und der Unterdrückung durch Menschen.",
      "id": "vad0520e59331j0",
      "source": "Sahih al-Bukhari 6369",
      "transliteration": "Allāhumma innī aʿūdhu bika min al-hammi wa al-ḥazan, wa al-ʿajzi wa al-kasal, wa al-bukhl wa al-jubn, wa ḍalaʿi al-dayn wa ghalabati al-rijāl.",
      "turkishTranslation": "Allah'ım! Senden kederden, üzüntüden, acizlikten, tembellikten, cimrilikten, korkaklıktan, borç yükünden ve insanların baskısından sana sığınırım.",
      "updated": "2025-05-08 19:17:36.788Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.791Z",
      "englishTranslation": "O Allah, I seek refuge in You from the punishment of the grave, from the torment of Hellfire, from the trials of life and death, and from the evil of the False Messiah.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor der Qual des Grabes, vor der Strafe des Höllenfeuers, vor den Prüfungen des Lebens und des Todes und vor dem Übel des falschen Messias.",
      "id": "otdp1598xr76559",
      "source": "Sahih Muslim 589",
      "transliteration": "Allāhumma innī aʿūdhu bika min ʿadhābi al-qabr, wa min ʿadhābi jahannam, wa min fitnati al-maḥyā wa al-mamāt, wa min sharri fitnati al-masīḥ al-dajjāl.",
      "turkishTranslation": "Allah'ım! Senden kabir azabından, cehennem azabından, hayat ve ölüm fitnesinden ve Deccal fitnesinin şerrinden sana sığınırım.",
      "updated": "2025-05-08 19:17:36.791Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.795Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "mg63p9fe2w85fwx",
      "source": "Sahih Muslim 2721",
      "transliteration": "Allāhumma innī as'aluka al-hudā wa al-tuqā wa al-ʿafāf wa al-ghinā.",
      "turkishTranslation": "Allah'ım! Senden hidayet, takva, iffet ve zenginlik (gönül zenginliği) istiyorum.",
      "updated": "2025-05-08 19:17:36.795Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.799Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the change in Your protection, the suddenness of Your punishment, and all forms of Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor dem Entzug Deiner Gaben, der Veränderung Deines Schutzes, dem plötzlichen Eintreffen Deiner Strafe und jeglichem Zorn von Dir.",
      "id": "jud655maa9bj6l4",
      "source": "Sahih Muslim 2739",
      "transliteration": "Allāhumma innī aʿūdhu bika min zawāli niʿmatika, wa taḥawwuli ʿāfiyatika, wa fujā'ati niqmatika, wa jamīʿi sakhaṭika.",
      "turkishTranslation": "Allah'ım! Nimetlerinin yok olmasından, afiyetinin değişmesinden, ansızın gelecek cezandan ve bütün gazabından sana sığınırım.",
      "updated": "2025-05-08 19:17:36.799Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.802Z",
      "englishTranslation": "O Allah, make our end good in all matters, and save us from the disgrace of this world and the punishment of the Hereafter.",
      "germanTranslation": "O Allah, mache unser Ende in allen Angelegenheiten gut und bewahre uns vor der Schande dieser Welt und der Strafe des Jenseits.",
      "id": "7vjd0gilw97fqki",
      "source": "Musnad Ahmad 3712",
      "transliteration": "Allāhumma aḥsin ʿāqibatanā fī al-umūri kullihā, wa ajirnā min khizyi al-dunyā wa ʿadhābi al-ākhira.",
      "turkishTranslation": "Allah'ım, bütün işlerimizin sonunu güzel eyle ve bizi dünyanın rezilliğinden ve ahiret azabından koru.",
      "updated": "2025-05-08 19:17:36.802Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.804Z",
      "englishTranslation": "O Allah, I ask You to enable me to do good deeds, abandon evil deeds, love the poor, and that You forgive me and have mercy on me.",
      "germanTranslation": "O Allah, ich bitte Dich darum, gute Taten zu vollbringen, Schlechtes zu unterlassen, die Armen zu lieben und dass Du mir vergibst und Dich meiner erbarmst.",
      "id": "x96184u7tv2f1n2",
      "source": "Sunan at-Tirmidhi 3233",
      "transliteration": "Allāhumma innī as'aluka fiʿla al-khayrāt, wa tarka al-munkarāt, wa ḥubba al-masākīn, wa an taghfira lī wa tarḥamanī.",
      "turkishTranslation": "Allah'ım! Senden hayırlı işler yapmayı, kötülükleri terk etmeyi, fakirleri sevmeyi, beni bağışlamanı ve bana merhamet etmeni istiyorum.",
      "updated": "2025-05-08 19:17:36.804Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.807Z",
      "englishTranslation": "O Allah, I seek refuge in You from severe calamity, from misery, from bad fate, and from the gloating of enemies.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor schweren Prüfungen, vor Unglück, vor schlechter Vorherbestimmung und vor der Schadenfreude der Feinde.",
      "id": "7j7k0voe971f5g5",
      "source": "Sahih al-Bukhari 6347",
      "transliteration": "Allāhumma innī aʿūdhu bika min jahdi al-balā', wa daraki al-shaqā', wa sū'i al-qaḍā', wa shamātati al-aʿdā'.",
      "turkishTranslation": "Allah'ım! Senden şiddetli belalardan, felakete düşmekten, kötü kazadan ve düşmanların sevinmesinden sana sığınırım.",
      "updated": "2025-05-08 19:17:36.807Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.810Z",
      "englishTranslation": "O Allah, I ask You for all that is good, in this world and the next, what I know of it and what I do not know. And I seek refuge in You from all evil, in this world and the next, what I know of it and what I do not know.",
      "germanTranslation": "O Allah, ich bitte Dich um alles Gute, im Diesseits und Jenseits, was ich davon weiß und was ich nicht weiß. Und ich suche Zuflucht bei Dir vor allem Übel, im Diesseits und Jenseits, was ich davon weiß und was ich nicht weiß.",
      "id": "52fyeixt0h1o7ey",
      "source": "Sunan Ibn Majah 3846",
      "transliteration": "Allāhumma innī as'aluka min al-khayri kullihi ʿājilihi wa ājilihi mā ʿalimtu minhu wa mā lam aʿlam, wa aʿūdhu bika min al-sharri kullihi ʿājilihi wa ājilihi mā ʿalimtu minhu wa mā lam aʿlam.",
      "turkishTranslation": "Allah'ım! Senden bütün hayırları istiyorum; dünyaya ve ahirete ait, bildiğim ve bilmediğim. Bütün kötülüklerden de sana sığınıyorum; dünyaya ve ahirete ait, bildiğim ve bilmediğim.",
      "updated": "2025-05-08 19:17:36.810Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.814Z",
      "englishTranslation": "O Allah, I ask You for pardon and well-being in this world and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Vergebung und Wohlergehen im Diesseits und im Jenseits.",
      "id": "3h6z72cv02fbmhl",
      "source": "Sunan Abu Dawud 5074",
      "transliteration": "Allāhumma innī as'aluka al-ʿafwa wa al-ʿāfiyata fī al-dunyā wa al-ākhira.",
      "turkishTranslation": "Allah'ım! Senden dünya ve ahirette af ve afiyet diliyorum.",
      "updated": "2025-05-08 19:17:36.814Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ صِحَّةً فِي إِيمَانٍ، وَإِيمَانًا فِي حُسْنِ خُلُقٍ، وَنَجَاحًا يَتْبَعُهُ فَلَاحٌ، وَرَحْمَةً مِنْكَ وَعَافِيَةً، وَمَغْفِرَةً مِنْكَ وَرِضْوَانًا",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.817Z",
      "englishTranslation": "O Allah, I ask You for soundness in faith, faith accompanied by good character, success followed by prosperity, Your mercy, well-being, Your forgiveness, and Your pleasure.",
      "germanTranslation": "O Allah, ich bitte Dich um Gesundheit im Glauben, Glauben mit gutem Charakter, Erfolg mit Wohlergehen, Deine Barmherzigkeit, Wohlergehen, Deine Vergebung und Dein Wohlgefallen.",
      "id": "7ac9o189yoeqqv1",
      "source": "Musnad Ahmad 17330",
      "transliteration": "Allāhumma innī as'aluka ṣiḥḥatan fī īmānin, wa īmānan fī ḥusni khuluqin, wa najāḥan yatbaʿuhu falāḥun, wa raḥmatan minka wa ʿāfiyatan, wa maghfiratan minka wa riḍwānan.",
      "turkishTranslation": "Allah'ım! Senden imanda sağlık, güzel ahlakla beraber iman, başarı ve mutluluk, rahmetin, afiyet, mağfiretin ve rızanı istiyorum.",
      "updated": "2025-05-08 19:17:36.817Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.821Z",
      "englishTranslation": "O Allah, I seek refuge in You from the evil of what I have done and from the evil of what I have not done.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor dem Übel dessen, was ich getan habe, und vor dem Übel dessen, was ich nicht getan habe.",
      "id": "2a550ywc231ms92",
      "source": "Sahih Muslim 2716",
      "transliteration": "Allāhumma innī aʿūdhu bika min sharri mā ʿamiltu wa min sharri mā lam aʿmal.",
      "turkishTranslation": "Allah'ım! Yaptıklarımın şerrinden ve yapmadıklarımın şerrinden sana sığınırım.",
      "updated": "2025-05-08 19:17:36.821Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.823Z",
      "englishTranslation": "O Allah, I seek refuge in You from laziness and old age, from sin and debt, from the trial of the grave and the punishment of the grave.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Faulheit und Alter, vor Sünde und Schulden, vor der Prüfung des Grabes und der Strafe des Grabes.",
      "id": "v6be44i7f6m395m",
      "source": "Sahih al-Bukhari 6367",
      "transliteration": "Allāhumma innī aʿūdhu bika min al-kasal wa al-haram, wa al-ma'tham wa al-maghram, wa min fitnati al-qabr wa ʿadhābi al-qabr.",
      "turkishTranslation": "Allah'ım! Senden tembellikten, ihtiyarlıktan, günahtan, borçtan, kabir fitnesinden ve kabir azabından sana sığınırım.",
      "updated": "2025-05-08 19:17:36.823Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ، وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.825Z",
      "englishTranslation": "O Allah, I ask You for Your love, the love of those who love You, and deeds that will bring me closer to Your love.",
      "germanTranslation": "O Allah, ich bitte Dich um Deine Liebe, die Liebe derer, die Dich lieben, und um Taten, die mich Deiner Liebe näherbringen.",
      "id": "z0cg2798217bmjp",
      "source": "Sunan at-Tirmidhi 3235",
      "transliteration": "Allāhumma innī as'aluka ḥubbaka wa ḥubba man yuḥibbuka, wa al-ʿamala alladhī yuballighunī ḥubbaka.",
      "turkishTranslation": "Allah'ım! Senden senin sevgini, seni sevenlerin sevgisini ve beni senin sevgine ulaştıracak amelleri istiyorum.",
      "updated": "2025-05-08 19:17:36.825Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.827Z",
      "englishTranslation": "O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not humble itself, from a soul that is never satisfied, and from a supplication that is not answered.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor nutzlosem Wissen, vor einem Herzen, das nicht demütig ist, vor einer Seele, die nie zufrieden ist, und vor einem Bittgebet, das nicht erhört wird.",
      "id": "p99f7a14570ji8w",
      "source": "Sahih Muslim 2722",
      "transliteration": "Allāhumma innī aʿūdhu bika min ʿilmin lā yanfaʿu, wa min qalbin lā yakhshaʿu, wa min nafsin lā tashbaʿu, wa min daʿwatin lā yustajābu lahā.",
      "turkishTranslation": "Allah'ım! Faydasız ilimden, huşû duymayan kalpten, doymayan nefisten ve kabul edilmeyen duadan sana sığınırım.",
      "updated": "2025-05-08 19:17:36.827Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
      "category": "Prayer",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:17:36.830Z",
      "englishTranslation": "O Allah, I ask You for Your pleasure and Paradise, and I seek refuge in You from Your displeasure and the Fire.",
      "germanTranslation": "O Allah, ich bitte Dich um Dein Wohlgefallen und das Paradies, und ich suche Zuflucht bei Dir vor Deinem Zorn und dem Höllenfeuer.",
      "id": "95jw5x06u9t5253",
      "source": "Sunan at-Tirmidhi 2577",
      "transliteration": "Allāhumma innī as'aluka riḍāka wa al-jannah, wa aʿūdhu bika min sakhaṭika wa al-nār.",
      "turkishTranslation": "Allah'ım! Senden rızanı ve cenneti istiyorum, gazabından ve cehennemden sana sığınırım.",
      "updated": "2025-05-08 19:17:36.830Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.863Z",
      "englishTranslation": "O Allah, I ask You for beneficial knowledge, goodly provision, and accepted deeds.",
      "germanTranslation": "O Allah, ich bitte Dich um nützliches Wissen, guten Lebensunterhalt und angenommene Taten.",
      "id": "0h54pi2hhz5s8p1",
      "source": "Sunan Ibn Majah, Hadith 925",
      "transliteration": "Allahumma inni as'aluka 'ilman nafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.",
      "turkishTranslation": "Allah'ım! Senden faydalı ilim, helal rızık ve kabul edilen amel istiyorum.",
      "updated": "2025-05-08 19:33:25.863Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.870Z",
      "englishTranslation": "My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me.",
      "germanTranslation": "Mein Herr, vergib mir und gewähre mir ein Königreich, das nach mir niemandem zusteht.",
      "id": "yu5651dnzq36x1q",
      "source": "Surah Sad 38:35",
      "transliteration": "Rabbighfir li wa hab li mulkan la yanbaghi li ahadin min ba'di.",
      "turkishTranslation": "Rabbim, beni bağışla ve bana benden sonra kimseye nasip olmayacak bir mülk ver.",
      "updated": "2025-05-08 19:33:25.870Z"
    },
    {
      "arabicText": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.874Z",
      "englishTranslation": "O Allah, suffice me with what You have made lawful instead of what You have made unlawful, and enrich me by Your bounty so that I have no need of anyone besides You.",
      "germanTranslation": "O Allah, versorge mich mit dem, was Du erlaubt hast, anstelle des Verbotenen, und bereichere mich durch Deine Gunst, sodass ich niemanden außer Dir brauche.",
      "id": "4g21ua3dpw6teln",
      "source": "Jami` at-Tirmidhi, Hadith 3563",
      "transliteration": "Allahumma-kfini bi halalika 'an haramik, wa aghnini bi fadlika 'amman siwak.",
      "turkishTranslation": "Allah'ım, helal kıldıklarınla beni haramlarından koru ve lütfunla beni Senden başkasına muhtaç etme.",
      "updated": "2025-05-08 19:33:25.874Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ، وَالْقِلَّةِ، وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.879Z",
      "englishTranslation": "O Allah, I seek refuge in You from poverty, scarcity, and humiliation, and I seek refuge in You from oppressing or being oppressed.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Armut, Mangel und Erniedrigung, und ich suche Zuflucht bei Dir davor, zu unterdrücken oder unterdrückt zu werden.",
      "id": "67073wo70v06wlx",
      "source": "Sunan Abu Dawood, Hadith 1544",
      "transliteration": "Allahumma inni a'udhu bika min al-faqri, wa al-qillati, wa adh-dhillati, wa a'udhu bika min an azlima aw uzlam.",
      "turkishTranslation": "Allah'ım! Senden fakirlikten, yokluktan ve zilletten sana sığınırım. Zulmetmekten veya zulme uğramaktan da sana sığınırım.",
      "updated": "2025-05-08 19:33:25.879Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.884Z",
      "englishTranslation": "Our Lord, give us in this world good and in the Hereafter good, and protect us from the punishment of the Fire.",
      "germanTranslation": "Unser Herr, gib uns im Diesseits Gutes und im Jenseits Gutes und bewahre uns vor der Strafe des Feuers.",
      "id": "3ka75pt3mzh9po7",
      "source": "Surah Al-Baqarah 2:201",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar.",
      "turkishTranslation": "Rabbimiz! Bize dünyada da iyilik ver, ahirette de iyilik ver ve bizi cehennem azabından koru.",
      "updated": "2025-05-08 19:33:25.884Z"
    },
    {
      "arabicText": "اللَّهُمَّ ارْزُقْنِي حُبَّكَ وَحُبَّ مَنْ يَنْفَعُنِي حُبُّهُ عِنْدَكَ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.886Z",
      "englishTranslation": "O Allah, grant me Your love and the love of those whose love will benefit me with You.",
      "germanTranslation": "O Allah, gewähre mir Deine Liebe und die Liebe derer, deren Liebe mir bei Dir nützt.",
      "id": "cw6v117p7ozrfw3",
      "source": "Sunan At-Tirmidhi, Hadith 3492",
      "transliteration": "Allahumma-rzuqni hubbaka wa hubba man yanfa'uni hubbuhu 'indak.",
      "turkishTranslation": "Allah'ım! Bana Senin sevgini ve Senin katında faydası olanların sevgisini nasip et.",
      "updated": "2025-05-08 19:33:25.886Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.890Z",
      "englishTranslation": "O Allah, rectify for me my religion, which is the safeguard of my affairs, and rectify for me my worldly life in which is my livelihood.",
      "germanTranslation": "O Allah, korrigiere für mich meine Religion, die der Schutz meiner Angelegenheiten ist, und korrigiere für mich mein weltliches Leben, in dem mein Lebensunterhalt liegt.",
      "id": "3plvd9x681w08hq",
      "source": "Sahih Muslim, Hadith 2720",
      "transliteration": "Allahumma aslih li diniya alladhi huwa 'ismatu amri, wa aslih li dunyaya allati fiha ma'ashi.",
      "turkishTranslation": "Allah'ım! İşlerimin güvencesi olan dinimi düzelt. Geçim kaynağım olan dünyamı da düzelt.",
      "updated": "2025-05-08 19:33:25.890Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.895Z",
      "englishTranslation": "O Allah, I ask You of Your bounty and mercy, for none possesses them except You.",
      "germanTranslation": "O Allah, ich bitte Dich um Deine Gunst und Barmherzigkeit, denn niemand außer Dir besitzt sie.",
      "id": "gce0e815a5bkbu6",
      "source": "Sahih Muslim, Hadith 2577",
      "transliteration": "Allahumma inni as'aluka min fadlika wa rahmatik, fa innahu la yamlikuha illa ant.",
      "turkishTranslation": "Allah'ım! Senden fazlını ve rahmetini istiyorum, çünkü onlara ancak Sen sahipsin.",
      "updated": "2025-05-08 19:33:25.895Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِزْقًا وَاسِعًا حَلَالًا طَيِّبًا",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.899Z",
      "englishTranslation": "O Allah, I ask You for abundant, lawful, and pure provision.",
      "germanTranslation": "O Allah, ich bitte Dich um reichlichen, erlaubten und reinen Lebensunterhalt.",
      "id": "93s24odp46315ml",
      "source": "Authentic (common dua)",
      "transliteration": "Allahumma inni as'aluka rizqan wasi'an halalan tayyiban.",
      "turkishTranslation": "Allah'ım! Senden bol, helal ve temiz rızık istiyorum.",
      "updated": "2025-05-08 19:33:25.899Z"
    },
    {
      "arabicText": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.902Z",
      "englishTranslation": "My Lord, expand for me my breast, ease for me my task, and untie the knot from my tongue that they may understand my speech.",
      "germanTranslation": "Mein Herr, weite mir meine Brust, erleichtere mir meine Aufgabe und löse den Knoten von meiner Zunge, damit sie meine Rede verstehen.",
      "id": "q39zz91q2xa09ry",
      "source": "Surah Ta-Ha 20:25-28",
      "transliteration": "Rabbishrah li sadri wa yassir li amri, wahlul 'uqdatan min lisanī yafqahu qawli.",
      "turkishTranslation": "Rabbim! Göğsümü genişlet, işimi kolaylaştır, dilimdeki düğümü çöz ki sözümü anlasınlar.",
      "updated": "2025-05-08 19:33:25.902Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.905Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "8494if0556304l9",
      "source": "Sahih Muslim, Hadith 2721",
      "transliteration": "Allahumma inni as'aluka al-huda wa at-tuqa wa al-'afafa wa al-ghina.",
      "turkishTranslation": "Allah'ım! Senden hidayet, takva, iffet ve zenginlik istiyorum.",
      "updated": "2025-05-08 19:33:25.905Z"
    },
    {
      "arabicText": "اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.908Z",
      "englishTranslation": "O Allah, Owner of Sovereignty, You give sovereignty to whom You will and take sovereignty away from whom You will. You honor whom You will and humble whom You will. In Your hand is all good. Indeed, You are over all things competent.",
      "germanTranslation": "O Allah, Besitzer der Herrschaft, Du gibst die Herrschaft, wem Du willst, und entziehst sie, wem Du willst. Du ehrst, wen Du willst, und erniedrigst, wen Du willst. In Deiner Hand ist alles Gute. Wahrlich, Du hast Macht über alle Dinge.",
      "id": "r0nx701969i4iql",
      "source": "Surah Al-Imran 3:26",
      "transliteration": "Allahumma malikal-mulki tu'til-mulka man tasha'u wa tanzi'ul-mulka mimman tasha'u wa tu'izzu man tasha'u wa tudhillu man tasha'u, bi yadikal-khayr, innaka 'ala kulli shay'in qadir.",
      "turkishTranslation": "Allah'ım! Mülkün sahibi sensin. Sen mülkü dilediğine verir, dilediğinden alırsın. Dilediğini aziz eder, dilediğini zelil edersin. Hayır Senin elindedir. Şüphesiz Sen her şeye kadirsin.",
      "updated": "2025-05-08 19:33:25.908Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.912Z",
      "englishTranslation": "O Allah, I ask You for the good of what Your Prophet Muhammad (peace be upon him) asked You for.",
      "germanTranslation": "O Allah, ich bitte Dich um das Gute, worum Dein Prophet Muhammad (Friede sei mit ihm) Dich gebeten hat.",
      "id": "99be6h79yamzt1l",
      "source": "Sahih Muslim, Hadith 1297",
      "transliteration": "Allahumma inni as'aluka min khayri ma sa'alaka minhu nabiyyuka Muhammadun sallallahu 'alayhi wa sallam.",
      "turkishTranslation": "Allah'ım! Peygamberin Muhammed'in (s.a.v.) Senden istediği hayırlı şeyleri ben de Senden istiyorum.",
      "updated": "2025-05-08 19:33:25.912Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْنِي مِنَ الَّذِينَ إِذَا أَصَابَهُمُ الْخَيْرُ حَمِدُوا وَإِذَا أَصَابَهُمُ الْبَلَاءُ صَبَرُوا",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.915Z",
      "englishTranslation": "O Allah, make me among those who, when blessed with good, are grateful, and when afflicted with calamity, are patient.",
      "germanTranslation": "O Allah, mache mich zu denen, die, wenn sie mit Gutem gesegnet sind, dankbar sind, und wenn sie mit Prüfungen heimgesucht werden, geduldig sind.",
      "id": "98lka9nni21d7ha",
      "source": "Authentic (common dua)",
      "transliteration": "Allahummaj'alni min alladhina idha asabahumul-khayru hamadu, wa idha asabahumul-bala'u sabaru.",
      "turkishTranslation": "Allah'ım! Beni, kendilerine hayır verildiğinde şükreden, belaya uğradıklarında sabredenlerden eyle.",
      "updated": "2025-05-08 19:33:25.915Z"
    },
    {
      "arabicText": "اللَّهُمَّ بَارِكْ لِي فِيمَا رَزَقْتَنِي وَقِنِي عَذَابَ النَّارِ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.919Z",
      "englishTranslation": "O Allah, bless me in what You have provided me and protect me from the punishment of the Fire.",
      "germanTranslation": "O Allah, segne mich in dem, was Du mir gegeben hast, und bewahre mich vor der Strafe des Feuers.",
      "id": "808z2i751rx6683",
      "source": "Authentic (common dua)",
      "transliteration": "Allahumma barik li fima razaqtani wa qini 'adhaban-nar.",
      "turkishTranslation": "Allah'ım! Bana verdiğin rızıkta bereket kıl ve beni ateş azabından koru.",
      "updated": "2025-05-08 19:33:25.919Z"
    },
    {
      "arabicText": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.923Z",
      "englishTranslation": "Our Lord, do not let our hearts deviate after You have guided us. Grant us Your mercy, for You are the Bestower.",
      "germanTranslation": "Unser Herr, lass unsere Herzen nicht abschweifen, nachdem Du uns rechtgeleitet hast. Gewähre uns Deine Barmherzigkeit, denn Du bist der Gabenverleiher.",
      "id": "cgm02s5hlpnal5l",
      "source": "Surah Al-Imran 3:8",
      "transliteration": "Rabbana la tuzigh qulubana ba'da idh hadaytana wa hab lana min ladunka rahmatan innaka antal-wahhab.",
      "turkishTranslation": "Rabbimiz! Bizi doğru yola ilettikten sonra kalplerimizi eğriltme. Bize katından bir rahmet bağışla. Şüphesiz Sen çok bağışlayansın.",
      "updated": "2025-05-08 19:33:25.923Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.925Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the change in Your protection, the suddenness of Your punishment, and all that displeases You.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir davor, dass Deine Gaben verschwinden, Dein Schutz sich ändert, Deine Strafe plötzlich kommt und vor allem, was Dich erzürnt.",
      "id": "ajlfn437nql4z74",
      "source": "Sahih Muslim, Hadith 2739",
      "transliteration": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik.",
      "turkishTranslation": "Allah'ım! Nimetlerinin yok olmasından, afiyetinin değişmesinden, cezanın aniden gelmesinden ve bütün gazabından Sana sığınırım.",
      "updated": "2025-05-08 19:33:25.925Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَتَرْكَ الْمُنْكَرَاتِ وَحُبَّ الْمَسَاكِينِ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.927Z",
      "englishTranslation": "O Allah, I ask You for the ability to do good deeds, abandon evil deeds, and love the poor.",
      "germanTranslation": "O Allah, ich bitte Dich um die Fähigkeit, gute Taten zu vollbringen, schlechte Taten zu unterlassen und die Armen zu lieben.",
      "id": "ad6027y865im13f",
      "source": "Sunan At-Tirmidhi, Hadith 3235",
      "transliteration": "Allahumma inni as'aluka fi'lal-khayrati wa tarkal-munkarati wa hubbal-masakin.",
      "turkishTranslation": "Allah'ım! Senden hayırları yapmayı, kötülükleri terk etmeyi ve fakirleri sevmeyi istiyorum.",
      "updated": "2025-05-08 19:33:25.927Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.930Z",
      "englishTranslation": "O Allah, I ask You for Paradise and seek refuge in You from the Fire.",
      "germanTranslation": "O Allah, ich bitte Dich um das Paradies und suche Zuflucht bei Dir vor dem Feuer.",
      "id": "5t7112d323tef73",
      "source": "Sunan Abu Dawood, Hadith 792",
      "transliteration": "Allahumma inni as'alukal-jannata wa a'udhu bika minan-nar.",
      "turkishTranslation": "Allah'ım! Senden cenneti istiyorum ve cehennemden Sana sığınıyorum.",
      "updated": "2025-05-08 19:33:25.930Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.934Z",
      "englishTranslation": "O Allah, I ask You for contentment after Your decree.",
      "germanTranslation": "O Allah, ich bitte Dich um Zufriedenheit nach Deinem Beschluss.",
      "id": "070pa1acqdqtj6x",
      "source": "Musnad Ahmad, Hadith 23074",
      "transliteration": "Allahumma inni as'aluka ar-rida ba'dal-qada.",
      "turkishTranslation": "Allah'ım! Hükmettikten sonra razı olmayı Senden istiyorum.",
      "updated": "2025-05-08 19:33:25.934Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا وَاسِعًا وَعَمَلًا مُتَقَبَّلًا",
      "category": "Wealth",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:25.938Z",
      "englishTranslation": "O Allah, I ask You for beneficial knowledge, abundant provision, and accepted deeds.",
      "germanTranslation": "O Allah, ich bitte Dich um nützliches Wissen, reichlichen Lebensunterhalt und angenommene Taten.",
      "id": "b9y30q5k1i09rmj",
      "source": "Sunan Ibn Majah, Hadith 925",
      "transliteration": "Allahumma inni as'aluka 'ilman nafi'an wa rizqan wasi'an wa 'amalan mutaqabbalan.",
      "turkishTranslation": "Allah'ım! Senden faydalı ilim, bol rızık ve kabul edilen amel istiyorum.",
      "updated": "2025-05-08 19:33:25.938Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.454Z",
      "englishTranslation": "O Allah, forgive him, have mercy on him, grant him safety, and pardon him.",
      "germanTranslation": "O Allah, vergib ihm, habe Erbarmen mit ihm, gewähre ihm Sicherheit und verzeihe ihm.",
      "id": "4g0pn261tuabd73",
      "source": "Sahih Muslim 963",
      "transliteration": "Allahumma ighfir lahu warhamhu wa 'afihi wa'fu 'anhu",
      "turkishTranslation": "Allah'ım, onu bağışla, ona merhamet et, ona afiyet ver ve onu affet.",
      "updated": "2025-05-08 19:33:39.454Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.458Z",
      "englishTranslation": "O Allah, forgive our living and our dead, those present and those absent, our young and our old, our males and our females.",
      "germanTranslation": "O Allah, vergib unseren Lebenden und unseren Toten, unseren Anwesenden und Abwesenden, unseren Jungen und Alten, unseren Männern und Frauen.",
      "id": "ytqzro18p4943b4",
      "source": "Sunan Abi Dawud 3201",
      "transliteration": "Allahumma ighfir lihayyina wa mayyitina wa shahidina wa gha'ibina wa sagheerina wa kabeerina wa thakarina wa unthana",
      "turkishTranslation": "Allah'ım, dirilerimizi ve ölülerimizi, hazır olanlarımızı ve gaip olanlarımızı, küçüklerimizi ve büyüklerimizi, erkeklerimizi ve kadınlarımızı bağışla.",
      "updated": "2025-05-08 19:33:39.458Z"
    },
    {
      "arabicText": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.461Z",
      "englishTranslation": "Indeed, we belong to Allah, and indeed to Him we will return.",
      "germanTranslation": "Wahrlich, wir gehören Allah, und wahrlich zu Ihm kehren wir zurück.",
      "id": "7hccj1745el4k5r",
      "source": "Quran 2:156",
      "transliteration": "Inna lillahi wa inna ilayhi raji'un",
      "turkishTranslation": "Şüphesiz biz Allah'a aidiz ve şüphesiz O'na döneceğiz.",
      "updated": "2025-05-08 19:33:39.461Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَجِرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.468Z",
      "englishTranslation": "O Allah, reward me in my affliction and replace it for me with something better.",
      "germanTranslation": "O Allah, belohne mich in meinem Unglück und ersetze es mir durch etwas Besseres.",
      "id": "zo0v2916fn67mdh",
      "source": "Sahih Muslim 918",
      "transliteration": "Allahumma ajirni fi museebati wakhluf li khayran minha",
      "turkishTranslation": "Allah'ım, beni musibetimde mükafatlandır ve onun yerine bana daha hayırlısını ver.",
      "updated": "2025-05-08 19:33:39.468Z"
    },
    {
      "arabicText": "اللَّهُمَّ ثَبِّتْهُ بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.473Z",
      "englishTranslation": "O Allah, make him firm with the firm word in this life and the Hereafter.",
      "germanTranslation": "O Allah, festige ihn mit dem festen Wort im diesseitigen Leben und im Jenseits.",
      "id": "07198l6t5ml09zy",
      "source": "Ibn Majah 1548",
      "transliteration": "Allahumma thabbit-hu bil-qawli-th-thabiti fil-hayati-d-dunya wa fil-akhirati",
      "turkishTranslation": "Allah'ım, onu dünya hayatında ve ahirette sabit bir sözle sabit kıl.",
      "updated": "2025-05-08 19:33:39.473Z"
    },
    {
      "arabicText": "اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.476Z",
      "englishTranslation": "O Allah, do not deprive us of his reward, and do not subject us to trials after him.",
      "germanTranslation": "O Allah, beraube uns nicht seines Lohnes und prüfe uns nicht nach ihm.",
      "id": "wt2va9juzy6r57x",
      "source": "Sunan Ibn Majah 1599",
      "transliteration": "Allahumma la tahrimna ajrahu wa la taftinna ba'dahu",
      "turkishTranslation": "Allah'ım, bizi onun ecrinden mahrum etme ve ondan sonra bizi fitneye düşürme.",
      "updated": "2025-05-08 19:33:39.476Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِفُلَانٍ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.480Z",
      "englishTranslation": "O Allah, forgive so-and-so and elevate his status among the guided ones.",
      "germanTranslation": "O Allah, vergib dem Soundso und erhöhe seinen Rang unter den Rechtgeleiteten.",
      "id": "dm141jhmb81t14p",
      "source": "Sahih Muslim 945",
      "transliteration": "Allahumma ighfir li fulan warfa' darajatahu fil-mahdiyyin",
      "turkishTranslation": "Allah'ım, falan kişiyi bağışla ve onun derecesini hidayete ermişler arasında yükselt.",
      "updated": "2025-05-08 19:33:39.480Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْرِ وَعَذَابِ النَّارِ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.484Z",
      "englishTranslation": "O Allah, protect him from the torment of the grave and the punishment of the Fire.",
      "germanTranslation": "O Allah, beschütze ihn vor der Qual des Grabes und der Strafe des Feuers.",
      "id": "6vyyogd558slf48",
      "source": "Sunan Ibn Majah 1548",
      "transliteration": "Allahumma a'ith-hu min 'adhabi-l-qabri wa 'adhabi-n-nar",
      "turkishTranslation": "Allah'ım, onu kabir azabından ve cehennem ateşinin azabından koru.",
      "updated": "2025-05-08 19:33:39.484Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْ قَبْرَهُ رَوْضَةً مِنْ رِيَاضِ الْجَنَّةِ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.491Z",
      "englishTranslation": "O Allah, make his grave a garden from the gardens of Paradise.",
      "germanTranslation": "O Allah, mache sein Grab zu einem Garten aus den Gärten des Paradieses.",
      "id": "so9sdphe5246hv6",
      "source": "Musnad Ahmad 3712",
      "transliteration": "Allahumma ij'al qabrahu rawdatan min riyadi-l-jannah",
      "turkishTranslation": "Allah'ım, onun kabrini cennet bahçelerinden bir bahçe eyle.",
      "updated": "2025-05-08 19:33:39.491Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.494Z",
      "englishTranslation": "O Allah, replace his home with a better home and his family with a better family.",
      "germanTranslation": "O Allah, ersetze sein Heim durch ein besseres Heim und seine Familie durch eine bessere Familie.",
      "id": "6q052v7vxev4p2r",
      "source": "Sahih Muslim 920",
      "transliteration": "Allahumma abdilhu daran khayran min darihi wa ahlan khayran min ahlihi",
      "turkishTranslation": "Allah'ım, onun evini daha hayırlı bir evle, ailesini daha hayırlı bir aileyle değiştir.",
      "updated": "2025-05-08 19:33:39.494Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَنْزِلْ عَلَى قَبْرِهِ الضِّيَاءَ وَالنُّورَ وَالْفَرَحَ وَالسُّرُورَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.498Z",
      "englishTranslation": "O Allah, send down upon his grave light, illumination, joy, and happiness.",
      "germanTranslation": "O Allah, sende auf sein Grab Licht, Erleuchtung, Freude und Glück herab.",
      "id": "z4e6564k350c4ox",
      "source": "Al-Adab al-Mufrad 223",
      "transliteration": "Allahumma anzil 'ala qabrihi-d-diya'a wan-nura wal-faraha was-surur",
      "turkishTranslation": "Allah'ım, onun kabrine ışık, nur, sevinç ve mutluluk indir.",
      "updated": "2025-05-08 19:33:39.498Z"
    },
    {
      "arabicText": "اللَّهُمَّ اكْتُبْهُ عِنْدَكَ فِي الْغُرِّ الْمُحَجَّلِينَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.501Z",
      "englishTranslation": "O Allah, record him with You among the foremost.",
      "germanTranslation": "O Allah, schreibe ihn bei Dir unter den Vorreitern ein.",
      "id": "d93x5bpuy5b7130",
      "source": "Sahih Bukhari 1242",
      "transliteration": "Allahumma uktubhu 'indaka fil-ghurri-l-muhajjalin",
      "turkishTranslation": "Allah'ım, onu Senin katında öncüler arasına yaz.",
      "updated": "2025-05-08 19:33:39.501Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْهُ مِنَ الْفَائِزِينَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.504Z",
      "englishTranslation": "O Allah, make him among the successful ones.",
      "germanTranslation": "O Allah, mache ihn zu einem der Erfolgreichen.",
      "id": "529f88b2d44fqi9",
      "source": "General Dua",
      "transliteration": "Allahumma ij'alhu minal-fa'izin",
      "turkishTranslation": "Allah'ım, onu kurtuluşa erenlerden eyle.",
      "updated": "2025-05-08 19:33:39.504Z"
    },
    {
      "arabicText": "اللَّهُمَّ ارْزُقْهُ الْجَنَّةَ بِغَيْرِ حِسَابٍ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.506Z",
      "englishTranslation": "O Allah, grant him Paradise without reckoning.",
      "germanTranslation": "O Allah, gewähre ihm das Paradies ohne Abrechnung.",
      "id": "0yjtg174x045036",
      "source": "General Dua",
      "transliteration": "Allahumma urzuqhu-l-jannata bighayri hisab",
      "turkishTranslation": "Allah'ım, onu hesapsız bir şekilde cennetle rızıklandır.",
      "updated": "2025-05-08 19:33:39.506Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.509Z",
      "englishTranslation": "O Allah, wash him with water, snow, and hail.",
      "germanTranslation": "O Allah, wasche ihn mit Wasser, Schnee und Hagel.",
      "id": "5wgnjze195t2831",
      "source": "Sahih Muslim 963",
      "transliteration": "Allahumma ighsilhu bil-ma'i wath-thalji wal-barad",
      "turkishTranslation": "Allah'ım, onu su, kar ve dolu ile yıka.",
      "updated": "2025-05-08 19:33:39.509Z"
    },
    {
      "arabicText": "اللَّهُمَّ نَقِّهِ مِنَ الذُّنُوبِ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.513Z",
      "englishTranslation": "O Allah, purify him of sins as a white garment is purified of filth.",
      "germanTranslation": "O Allah, reinige ihn von Sünden, wie ein weißes Gewand von Schmutz gereinigt wird.",
      "id": "nd505ov07z9t5lg",
      "source": "Sahih Bukhari 1352",
      "transliteration": "Allahumma naqqihi minadh-dhunubi kama yunaqqa-th-thawbu-l-abyadhu minad-danas",
      "turkishTranslation": "Allah'ım, onu günahlardan temizle, tıpkı beyaz elbisenin kirden temizlendiği gibi.",
      "updated": "2025-05-08 19:33:39.513Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَلْحِقْهُ بِالصَّالِحِينَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.517Z",
      "englishTranslation": "O Allah, join him with the righteous.",
      "germanTranslation": "O Allah, füge ihn den Rechtschaffenen bei.",
      "id": "248ej428yrv7zi7",
      "source": "General Dua",
      "transliteration": "Allahumma alhiqhu bis-salihin",
      "turkishTranslation": "Allah'ım, onu salihlerle bir araya getir.",
      "updated": "2025-05-08 19:33:39.517Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَعْطِهِ فِي الْجَنَّةِ مَنْزِلًا حَسَنًا",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.521Z",
      "englishTranslation": "O Allah, grant him a beautiful abode in Paradise.",
      "germanTranslation": "O Allah, gewähre ihm eine schöne Wohnstätte im Paradies.",
      "id": "bqz3e1958p85s40",
      "source": "General Dua",
      "transliteration": "Allahumma a'thi fil-jannati manzilan hasanan",
      "turkishTranslation": "Allah'ım, ona cennette güzel bir makam ver.",
      "updated": "2025-05-08 19:33:39.521Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْهُ فِي كَنَفِكَ وَأَمَانِكَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.524Z",
      "englishTranslation": "O Allah, place him under Your protection and security.",
      "germanTranslation": "O Allah, platziere ihn unter Deinem Schutz und Deiner Sicherheit.",
      "id": "nc0ry3l23ou9lx2",
      "source": "General Dua",
      "transliteration": "Allahumma ij'alhu fi kanafika wa amanika",
      "turkishTranslation": "Allah'ım, onu Senin koruman ve emniyetin altına al.",
      "updated": "2025-05-08 19:33:39.524Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَظِلَّهُ فِي ظِلِّكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّكَ",
      "category": "Death",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:33:39.527Z",
      "englishTranslation": "O Allah, shade him under Your shade on the Day when there is no shade except Yours.",
      "germanTranslation": "O Allah, beschatte ihn unter Deinem Schatten am Tag, an dem es keinen Schatten außer Deinem gibt.",
      "id": "51vtff81w6m856d",
      "source": "Sahih Bukhari 1423",
      "transliteration": "Allahumma adhillahu fi zillika yawma la zilla illa zilluk",
      "turkishTranslation": "Allah'ım, onu Senin gölgenden başka gölgenin olmadığı günde Senin gölgende gölgelendir.",
      "updated": "2025-05-08 19:33:39.526Z"
    },
     {
      "arabicText": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.831Z",
      "englishTranslation": "Our Lord, grant us from among our spouses and offspring comfort to our eyes and make us an example for the righteous.",
      "germanTranslation": "Unser Herr, schenke uns aus unseren Gattinnen und Nachkommen Augentrost und mache uns zu einem Vorbild für die Gottesfürchtigen.",
      "id": "s6gvcb6v71b3b79",
      "source": "Quran 25:74",
      "transliteration": "Rabbana hab lana min azwajina wa dhurriyatina qurrata a'yunin waj'alna lil-muttaqina imama.",
      "turkishTranslation": "Rabbimiz, bize eşlerimizden ve çocuklarımızdan göz aydınlığı ver ve bizi takva sahiplerine önder kıl.",
      "updated": "2025-05-08 19:40:28.831Z"
    },
    {
      "arabicText": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَفِي بَصَرِي نُورًا وَفِي سَمْعِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ شِمَالِي نُورًا وَأَمَامِي نُورًا وَخَلْفِي نُورًا وَفَوْقِي نُورًا وَتَحْتِي نُورًا وَاجْعَلْ لِي نُورًا",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.842Z",
      "englishTranslation": "O Allah, place light in my heart, light in my sight, light in my hearing, light on my right, light on my left, light before me, light behind me, light above me, light below me, and make light for me.",
      "germanTranslation": "O Allah, lege Licht in mein Herz, Licht in mein Sehen, Licht in mein Hören, Licht zu meiner Rechten, Licht zu meiner Linken, Licht vor mir, Licht hinter mir, Licht über mir, Licht unter mir und mache Licht für mich.",
      "id": "a20hpnm1s8yazf3",
      "source": "Sahih Bukhari 6316",
      "transliteration": "Allahumma-j'al fi qalbi nura wa fi basari nura wa fi sam'i nura wa 'an yamini nura wa 'an shimali nura wa amami nura wa khalfi nura wa fawqi nura wa tahti nura waj'al li nura.",
      "turkishTranslation": "Allah'ım, kalbime nur koy, gözüme nur koy, kulağıma nur koy, sağıma nur koy, soluma nur koy, önüme nur koy, arkama nur koy, üstüme nur koy, altıma nur koy ve bana nur ver.",
      "updated": "2025-05-08 19:40:28.842Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَلِّفْ بَيْنَ قُلُوبِنَا وَأَصْلِحْ ذَاتَ بَيْنِنَا وَاهْدِنَا سُبُلَ السَّلَامِ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.847Z",
      "englishTranslation": "O Allah, bring harmony between our hearts, reconcile our relations, and guide us to the paths of peace.",
      "germanTranslation": "O Allah, schaffe Harmonie zwischen unseren Herzen, versöhne unsere Beziehungen und führe uns auf die Wege des Friedens.",
      "id": "u04vl81q20y3x55",
      "source": "Musnad Ahmad 1386",
      "transliteration": "Allahumma allif bayna qulubina wa aslih dhat baynina wahdina subul as-salam.",
      "turkishTranslation": "Allah'ım, kalplerimiz arasında sevgi ve uyum oluştur, aramızı düzelt ve bizi barış yollarına ilet.",
      "updated": "2025-05-08 19:40:28.847Z"
    },
    {
      "arabicText": "اللَّهُمَّ ارْزُقْنِي حُبَّكَ وَحُبَّ مَنْ يَنْفَعُنِي حُبُّهُ عِنْدَكَ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.852Z",
      "englishTranslation": "O Allah, grant me Your love and the love of those whose love will benefit me in Your sight.",
      "germanTranslation": "O Allah, gewähre mir Deine Liebe und die Liebe derer, deren Liebe mir bei Dir nützt.",
      "id": "2uu06pa9710kzg0",
      "source": "Tirmidhi 3491",
      "transliteration": "Allahumma-rzuqni hubbaka wa hubba man yanfa'uni hubbuhu 'indaka.",
      "turkishTranslation": "Allah'ım, bana Senin sevgini ve Senin katında sevgisi bana fayda verecek olanların sevgisini nasip et.",
      "updated": "2025-05-08 19:40:28.852Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَحُبَّ عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّكَ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.858Z",
      "englishTranslation": "O Allah, I ask You for Your love, the love of those who love You, and the love of deeds that bring me closer to Your love.",
      "germanTranslation": "O Allah, ich bitte Dich um Deine Liebe, die Liebe derer, die Dich lieben, und die Liebe zu Taten, die mich Deiner Liebe näherbringen.",
      "id": "9i5n4c9bw0e7tzf",
      "source": "Tirmidhi 3235",
      "transliteration": "Allahumma inni as'aluka hubbaka wa hubba man yuhibbuka wa hubba 'amalin yuqarribuni ila hubbika.",
      "turkishTranslation": "Allah'ım, Senden kendi sevgini, Seni sevenlerin sevgisini ve beni Senin sevgine yaklaştıracak amellerin sevgisini istiyorum.",
      "updated": "2025-05-08 19:40:28.858Z"
    },
    {
      "arabicText": "اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.862Z",
      "englishTranslation": "O Allah, Owner of Sovereignty, You grant sovereignty to whom You will and take it away from whom You will. You honor whom You will and humble whom You will. In Your hand is all good. Indeed, You are over all things competent.",
      "germanTranslation": "O Allah, Besitzer der Herrschaft, Du gibst die Herrschaft, wem Du willst, und nimmst sie, wem Du willst. Du ehrst, wen Du willst, und erniedrigst, wen Du willst. In Deiner Hand ist alles Gute. Wahrlich, Du hast Macht über alle Dinge.",
      "id": "mde390hgq325284",
      "source": "Quran 3:26",
      "transliteration": "Allahumma malikal-mulki tu'til-mulka man tasha'u wa tanzi'ul-mulka mimman tasha'u wa tu'izzu man tasha'u wa tudhillu man tasha'u biyadikal-khayr, innaka 'ala kulli shay'in qadir.",
      "turkishTranslation": "Allah'ım, mülkün sahibi sensin, mülkü dilediğine verirsin ve dilediğinden alırsın. Dilediğini yüceltir, dilediğini alçaltırsın. Hayır Senin elindedir. Şüphesiz Sen her şeye kadirsin.",
      "updated": "2025-05-08 19:40:28.862Z"
    },
    {
      "arabicText": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.868Z",
      "englishTranslation": "My Lord, expand my chest for me, ease my task for me, and remove the impediment from my tongue so that they may understand my speech.",
      "germanTranslation": "Mein Herr, weite mir meine Brust, erleichtere mir meine Aufgabe und löse den Knoten von meiner Zunge, damit sie meine Worte verstehen.",
      "id": "ubou506qcjs98je",
      "source": "Quran 20:25-28",
      "transliteration": "Rabbishrah li sadri wa yassir li amri wahlul 'uqdatan min lisanī yafqahu qawli.",
      "turkishTranslation": "Rabbim, göğsümü genişlet, işimi kolaylaştır ve dilimden düğümü çöz ki sözümü anlasınlar.",
      "updated": "2025-05-08 19:40:28.868Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.886Z",
      "englishTranslation": "O Allah, I seek refuge in You from distress, grief, incapacity, laziness, miserliness, cowardice, debt, and being overpowered by men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer, Trauer, Schwäche, Faulheit, Geiz, Feigheit, Schuldenlast und der Unterdrückung durch Menschen.",
      "id": "k76fk24imm3l2v6",
      "source": "Sahih Bukhari 6369",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazani wal-'ajzi wal-kasali wal-bukhli wal-jubni wa dala'id-dayni wa ghalabatir-rijal.",
      "turkishTranslation": "Allah'ım, Senden sıkıntıdan, kederden, acizlikten, tembellikten, cimrilikten, korkaklıktan, borç yükünden ve insanların baskısından sana sığınırım.",
      "updated": "2025-05-08 19:40:28.886Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَتَرْكَ الْمُنْكَرَاتِ وَحُبَّ الْمَسَاكِينِ وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.891Z",
      "englishTranslation": "O Allah, I ask You for the ability to do good deeds, abandon evil deeds, love the poor, and that You forgive me and have mercy on me.",
      "germanTranslation": "O Allah, ich bitte Dich um die Fähigkeit, Gutes zu tun, Schlechtes zu unterlassen, die Armen zu lieben und dass Du mir vergibst und mir barmherzig bist.",
      "id": "256i8620s2c9239",
      "source": "Tirmidhi 3233",
      "transliteration": "Allahumma inni as'aluka fi'lal-khayrati wa tarkal-munkarati wa hubbal-masakini wa an taghfira li wa tarhamani.",
      "turkishTranslation": "Allah'ım, Senden iyilik yapmayı, kötülükten uzak durmayı, fakirleri sevmeyi, beni bağışlamanı ve bana merhamet etmeni istiyorum.",
      "updated": "2025-05-08 19:40:28.891Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.895Z",
      "englishTranslation": "O Allah, rectify my religion, which is the safeguard of my affairs, rectify my worldly life, in which is my livelihood, and rectify my Hereafter, to which is my return. Make life an increase for me in every good and make death a relief for me from every evil.",
      "germanTranslation": "O Allah, korrigiere meine Religion, die der Schutz meiner Angelegenheiten ist, korrigiere mein weltliches Leben, in dem mein Lebensunterhalt liegt, und korrigiere mein Jenseits, zu dem meine Rückkehr ist. Mache das Leben für mich zu einer Zunahme an jedem Guten und mache den Tod für mich zu einer Erleichterung von allem Übel.",
      "id": "3lrz7097bw9cbg9",
      "source": "Sahih Muslim 2720",
      "transliteration": "Allahumma aslih li diniyalladhi huwa 'ismatu amri wa aslih li dunyaya allati fiha ma'ashi wa aslih li akhirati allati fiha ma'adi waj'alil-hayata ziyadatan li fi kulli khayrin waj'alil-mawta rahatan li min kulli sharrin.",
      "turkishTranslation": "Allah'ım, işlerimin koruyucusu olan dinimi düzelt, geçim kaynağım olan dünyamı düzelt, dönüş yerim olan ahiretimi düzelt. Hayatı her hayırda artış, ölümü de her şerden kurtuluş kıl.",
      "updated": "2025-05-08 19:40:28.895Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.898Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "53a57x5wb58cu83",
      "source": "Sahih Muslim 2721",
      "transliteration": "Allahumma inni as'alukal-huda wat-tuqa wal-'afafa wal-ghina.",
      "turkishTranslation": "Allah'ım, Senden hidayet, takva, iffet ve zenginlik istiyorum.",
      "updated": "2025-05-08 19:40:28.898Z"
    },
    {
      "arabicText": "اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.900Z",
      "englishTranslation": "O Allah, adorn us with the adornment of faith and make us guides who are rightly guided.",
      "germanTranslation": "O Allah, schmücke uns mit dem Schmuck des Glaubens und mache uns zu rechtgeleiteten Führern.",
      "id": "84e7620j4idnj02",
      "source": "Musnad Ahmad 12596",
      "transliteration": "Allahumma zayyinna bizeenatil-imani waj'alna hudaatan muhtadeen.",
      "turkishTranslation": "Allah'ım, bizi imanın ziynetiyle süsle ve bizi doğru yolu bulan ve gösterenlerden eyle.",
      "updated": "2025-05-08 19:40:28.900Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.903Z",
      "englishTranslation": "O Allah, I ask You for Your love, the love of those who love You, and the deeds that will bring me to Your love.",
      "germanTranslation": "O Allah, ich bitte Dich um Deine Liebe, die Liebe derer, die Dich lieben, und die Taten, die mich zu Deiner Liebe führen.",
      "id": "1456f4dgaldh0fx",
      "source": "Tirmidhi 3491",
      "transliteration": "Allahumma inni as'aluka hubbaka wa hubba man yuhibbuka wal-'amalalladhi yuballighuni hubbaka.",
      "turkishTranslation": "Allah'ım, Senden kendi sevgini, Seni sevenlerin sevgisini ve beni Senin sevgine ulaştıracak amelleri istiyorum.",
      "updated": "2025-05-08 19:40:28.903Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَجْأَةِ الْخَيْرِ وَأَعُوذُ بِكَ مِنْ فَجْأَةِ الشَّرِّ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.905Z",
      "englishTranslation": "O Allah, I ask You for sudden goodness, and I seek refuge in You from sudden evil.",
      "germanTranslation": "O Allah, ich bitte Dich um plötzliches Gutes und suche Zuflucht bei Dir vor plötzlichem Übel.",
      "id": "3tl6yypt66pdod8",
      "source": "Sunan Ibn Majah 3835",
      "transliteration": "Allahumma inni as'aluka min faj'atil-khayri wa a'udhu bika min faj'atish-sharr.",
      "turkishTranslation": "Allah'ım, Senden ani hayırlar diliyor ve ani şerlerden Sana sığınıyorum.",
      "updated": "2025-05-08 19:40:28.905Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.907Z",
      "englishTranslation": "O Allah, I ask You for Your pleasure and Paradise, and I seek refuge in You from Your anger and the Fire.",
      "germanTranslation": "O Allah, ich bitte Dich um Dein Wohlgefallen und das Paradies und suche Zuflucht bei Dir vor Deinem Zorn und dem Feuer.",
      "id": "t95o1w8bm30v411",
      "source": "Sunan Abu Dawud 792",
      "transliteration": "Allahumma inni as'aluka ridaka wal-jannata wa a'udhu bika min sakhatika wan-nar.",
      "turkishTranslation": "Allah'ım, Senden rızanı ve cenneti istiyorum, gazabından ve cehennemden Sana sığınıyorum.",
      "updated": "2025-05-08 19:40:28.907Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ عِبَادُكَ الصَّالِحُونَ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَكَ مِنْهُ عِبَادُكَ الصَّالِحُونَ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.911Z",
      "englishTranslation": "O Allah, I ask You for the good that Your righteous servants have asked You for, and I seek refuge in You from the evil from which Your righteous servants have sought refuge.",
      "germanTranslation": "O Allah, ich bitte Dich um das Gute, das Deine rechtschaffenen Diener von Dir erbeten haben, und ich suche Zuflucht bei Dir vor dem Übel, vor dem Deine rechtschaffenen Diener Zuflucht gesucht haben.",
      "id": "bxvcfqyulv8w23r",
      "source": "Tirmidhi 3524",
      "transliteration": "Allahumma inni as'aluka min khayri ma sa'alaka minhu 'ibadukas-salihun wa a'udhu bika min sharri ma-sta'adha minhu 'ibadukas-salihun.",
      "turkishTranslation": "Allah'ım, Senden salih kullarının istediği hayırları istiyorum ve salih kullarının sığındığı şerlerden Sana sığınıyorum.",
      "updated": "2025-05-08 19:40:28.911Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.913Z",
      "englishTranslation": "O Allah, I ask You for pardon and well-being in this world and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Vergebung und Wohlergehen im Diesseits und im Jenseits.",
      "id": "0sn0j34gst4dm50",
      "source": "Sunan Ibn Majah 3871",
      "transliteration": "Allahumma inni as'alukal-'afwa wal-'afiyata fid-dunya wal-akhirah.",
      "turkishTranslation": "Allah'ım, Senden dünya ve ahirette af ve afiyet diliyorum.",
      "updated": "2025-05-08 19:40:28.913Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فَوَاتِحَ الْخَيْرِ وَخَوَاتِيمَهُ وَجَوَامِعَهُ وَأَوَّلَهُ وَآخِرَهُ وَظَاهِرَهُ وَبَاطِنَهُ وَالدَّرَجَاتِ الْعُلَى مِنَ الْجَنَّةِ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.916Z",
      "englishTranslation": "O Allah, I ask You for the beginnings of good, its endings, its totality, its first, its last, its apparent, its hidden, and the highest ranks of Paradise.",
      "germanTranslation": "O Allah, ich bitte Dich um die Anfänge des Guten, seine Enden, seine Gesamtheit, sein Erstes, sein Letztes, sein Offensichtliches, sein Verborgenes und die höchsten Stufen des Paradieses.",
      "id": "w71oc3kdey1zs1f",
      "source": "Musnad Ahmad 12366",
      "transliteration": "Allahumma inni as'aluka fawatiḥal-khayri wa khawatimahu wa jawami'ahu wa awwalahu wa akhirahu wa zahirahu wa batinahu wad-darajatil-'ula minal-jannah.",
      "turkishTranslation": "Allah'ım, Senden hayrın başlangıçlarını, sonuçlarını, toplamını, ilkini, sonunu, zahirini, batınını ve cennetin en yüksek derecelerini istiyorum.",
      "updated": "2025-05-08 19:40:28.916Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَسْأَلَةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ الْعِلْمِ وَخَيْرَ الْعَمَلِ وَخَيْرَ الثَّوَابِ وَخَيْرَ الْحَيَاةِ وَخَيْرَ الْمَمَاتِ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.919Z",
      "englishTranslation": "O Allah, I ask You for the best of requests, the best of supplications, the best of success, the best of knowledge, the best of deeds, the best of rewards, the best of life, and the best of death.",
      "germanTranslation": "O Allah, ich bitte Dich um das Beste der Bitten, das Beste der Bittgebete, das Beste des Erfolgs, das Beste des Wissens, das Beste der Taten, das Beste der Belohnung, das Beste des Lebens und das Beste des Todes.",
      "id": "2h046o9g2s4a4ox",
      "source": "Musnad Ahmad 12619",
      "transliteration": "Allahumma inni as'aluka khayral-mas'alati wa khayrad-du'a'i wa khayran-najahi wa khayral-'ilmi wa khayral-'amali wa khayratha-thawabi wa khayral-hayati wa khayral-mamati.",
      "turkishTranslation": "Allah'ım, Senden istenenlerin en hayırlısını, duaların en hayırlısını, başarının en hayırlısını, ilmin en hayırlısını, amellerin en hayırlısını, mükafatın en hayırlısını, hayatın en hayırlısını ve ölümün en hayırlısını istiyorum.",
      "updated": "2025-05-08 19:40:28.919Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ",
      "category": "Love",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:28.923Z",
      "englishTranslation": "O Allah, I ask You for Paradise and for that which brings one closer to it, in word and deed, and I seek refuge in You from Hell and from that which brings one closer to it, in word and deed.",
      "germanTranslation": "O Allah, ich bitte Dich um das Paradies und um das, was einem im Wort und in der Tat näher dazu bringt, und ich suche Zuflucht bei Dir vor der Hölle und vor dem, was einem im Wort und in der Tat näher dazu bringt.",
      "id": "tkq3g875o94g606",
      "source": "Sunan Ibn Majah 3836",
      "transliteration": "Allahumma inni as'alukal-jannata wa ma qarraba ilayha min qawlin aw 'amalin wa a'udhu bika minan-nari wa ma qarraba ilayha min qawlin aw 'amalin.",
      "turkishTranslation": "Allah'ım, Senden cenneti ve ona yaklaştıran söz ve amelleri istiyorum, cehennemden ve ona yaklaştıran söz ve amellerden Sana sığınıyorum.",
      "updated": "2025-05-08 19:40:28.923Z"
    },
    {
      "arabicText": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.447Z",
      "englishTranslation": "O my Lord, indeed I have wronged myself, so forgive me.",
      "germanTranslation": "O mein Herr, ich habe mir selbst Unrecht getan, so vergib mir.",
      "id": "77g02hm0fz7up95",
      "source": "Quran 28:16",
      "transliteration": "Rabbee innee zalamtu nafsee faghfir lee",
      "turkishTranslation": "Rabbim, gerçekten kendime zulmettim, beni bağışla.",
      "updated": "2025-05-08 19:40:42.447Z"
    },
    {
      "arabicText": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.451Z",
      "englishTranslation": "I seek forgiveness from Allah and repent to Him.",
      "germanTranslation": "Ich bitte Allah um Vergebung und bereue vor Ihm.",
      "id": "0i76fcrqq75msh1",
      "source": "Hadith (Bukhari, Muslim)",
      "transliteration": "Astaghfirullah wa atoobu ilayh",
      "turkishTranslation": "Allah'tan bağışlanma diliyor ve O'na tövbe ediyorum.",
      "updated": "2025-05-08 19:40:42.451Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.454Z",
      "englishTranslation": "O Allah, I have wronged myself greatly, and none forgives sins except You. So grant me forgiveness from You and have mercy on me. Indeed, You are the Oft-Forgiving, Most Merciful.",
      "germanTranslation": "O Allah, ich habe mir selbst großes Unrecht getan, und niemand vergibt die Sünden außer Dir. So gewähre mir Vergebung von Dir und habe Erbarmen mit mir. Wahrlich, Du bist der Allvergebende, der Barmherzige.",
      "id": "97485tx0q8546t8",
      "source": "Hadith (Bukhari, Muslim)",
      "transliteration": "Allahumma innee zalamtu nafsee thulman katheera, wa la yaghfirudh-dhunuba illa anta, faghfirlee maghfiratan min 'indika, warhamnee, innaka antal-Ghafoorur-Raheem",
      "turkishTranslation": "Allah'ım, kendime çok zulmettim, günahları ancak Sen bağışlarsın. Bana katından bir mağfiret ver ve bana merhamet et. Şüphesiz Sen, çok bağışlayansın, çok merhametlisin.",
      "updated": "2025-05-08 19:40:42.454Z"
    },
    {
      "arabicText": "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.458Z",
      "englishTranslation": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
      "germanTranslation": "Unser Herr, wir haben uns selbst Unrecht getan, und wenn Du uns nicht vergibst und uns nicht barmherzig bist, werden wir gewiss unter den Verlierern sein.",
      "id": "u6z3365j6wmehwd",
      "source": "Quran 7:23",
      "transliteration": "Rabbana thalamna anfusana wa-in lam taghfir lana watarhamna lanakoonanna mina alkhasireen",
      "turkishTranslation": "Rabbimiz, biz kendimize zulmettik. Eğer bizi bağışlamaz ve bize merhamet etmezsen, mutlaka hüsrana uğrayanlardan oluruz.",
      "updated": "2025-05-08 19:40:42.458Z"
    },
    {
      "arabicText": "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.462Z",
      "englishTranslation": "O Allah, forgive my mistakes, my ignorance, my excesses in my affairs, and what You know better than me. O Allah, forgive my seriousness and my jest, my errors and my intentional sins, for all of that is from me.",
      "germanTranslation": "O Allah, vergib mir meine Fehler, meine Unwissenheit, mein Übermaß in meinen Angelegenheiten und das, was Du besser weißt als ich. O Allah, vergib mir mein Ernst und meinen Scherz, meine Versehen und meine vorsätzlichen Sünden, denn all das ist von mir.",
      "id": "g7yv02431a02q1l",
      "source": "Hadith (Bukhari)",
      "transliteration": "Allahumma-ghfir lee khatee'atee wa jahlee, wa israafee fee amree, wa ma anta a'lamu bihi minnee. Allahumma-ghfir lee jiddi wa hazlee, wa khata'ee wa 'amdee, wa kullu thalika 'indee",
      "turkishTranslation": "Allah'ım, hatalarımı, cehaletimi, işlerimdeki aşırılıklarımı ve Senin benden daha iyi bildiklerini bağışla. Allah'ım, ciddi halimi, şakalarımı, hatalarımı ve kasıtlı günahlarımı bağışla, çünkü bunların hepsi benden kaynaklanmıştır.",
      "updated": "2025-05-08 19:40:42.462Z"
    },
    {
      "arabicText": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.466Z",
      "englishTranslation": "Glory be to You, O Allah, and praise be to You. I bear witness that there is no deity but You. I seek Your forgiveness and repent to You.",
      "germanTranslation": "Preis sei Dir, O Allah, und Lob sei Dir. Ich bezeuge, dass es keinen Gott gibt außer Dir. Ich bitte Dich um Vergebung und bereue vor Dir.",
      "id": "86937lj1yd631d5",
      "source": "Hadith (Tirmidhi)",
      "transliteration": "Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa anta, astaghfiruka wa atoobu ilayk",
      "turkishTranslation": "Seni eksikliklerden tenzih ederim Allah'ım ve Sana hamd ederim. Şahitlik ederim ki Senden başka ilah yoktur. Senden bağışlanma diliyor ve Sana tövbe ediyorum.",
      "updated": "2025-05-08 19:40:42.466Z"
    },
    {
      "arabicText": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.470Z",
      "englishTranslation": "My Lord, forgive me and accept my repentance, for You are the Accepter of Repentance, the Most Merciful.",
      "germanTranslation": "Mein Herr, vergib mir und nimm meine Reue an, denn Du bist der Reue-Annehmende, der Barmherzige.",
      "id": "i5ul65630vf4qkl",
      "source": "Quran 17:25",
      "transliteration": "Rabbighfir lee watub 'alayya innaka antat-Tawwabur-Raheem",
      "turkishTranslation": "Rabbim, beni bağışla ve tövbemi kabul et. Şüphesiz Sen, tövbeleri kabul edensin, çok merhametlisin.",
      "updated": "2025-05-08 19:40:42.470Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لاَ إِلَهَ إِلاَّ أَنْتَ، وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَاوَاتِ وَالأَرْضِ، يَا ذَا الْجَلالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ، إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.474Z",
      "englishTranslation": "O Allah, I ask You by the fact that all praise is Yours, there is no deity but You alone, with no partner, the Bestower of Favors, O Originator of the heavens and the earth, O Possessor of Majesty and Honor, O Ever-Living, O Sustainer, I have wronged myself, so forgive me.",
      "germanTranslation": "O Allah, ich bitte Dich dadurch, dass aller Lobpreis Dir gehört, es gibt keinen Gott außer Dir allein, ohne Partner, der Wohltäter, O Schöpfer der Himmel und der Erde, O Besitzer der Majestät und der Ehre, O Ewiglebende, O Erhalter, ich habe mir selbst Unrecht getan, so vergib mir.",
      "id": "5or2v3625u8zzg6",
      "source": "Hadith (Abu Dawud, Tirmidhi)",
      "transliteration": "Allahumma inni as'aluka bi-anna lakal-hamd, la ilaha illa anta, wahdaka la shareeka lak, al-Mannan, ya Badi'as-samawati wal-ard, ya Dhal-Jalali wal-Ikram, ya Hayyu ya Qayyum, inni zalamtu nafsee faghfir lee",
      "turkishTranslation": "Allah'ım, Sana hamdın yalnızca Sana ait olduğu, Senden başka ilah olmadığı, ortağın bulunmadığı, nimetler veren, ey göklerin ve yerin yaratıcısı, ey Celal ve İkram sahibi, ey Hayy ve Kayyum olan Allah'ım, kendime zulmettim, beni bağışla.",
      "updated": "2025-05-08 19:40:42.474Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.478Z",
      "englishTranslation": "O Allah, I seek refuge in You from grief and sorrow, from weakness and laziness, from cowardice and miserliness, and from being overpowered by debt and the oppression of men.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Kummer und Traurigkeit, vor Schwäche und Faulheit, vor Feigheit und Geiz, und davor, von Schulden überwältigt zu werden und vor der Unterdrückung durch Menschen.",
      "id": "ko4pqu7o43638kc",
      "source": "Hadith (Bukhari)",
      "transliteration": "Allahumma inni a'oodhu bika minal-hammi wal-hazan, wa a'oodhu bika minal-'ajzi wal-kasal, wa a'oodhu bika minal-jubni wal-bukhl, wa a'oodhu bika min ghalabatid-dayn wa qahrir-rijal",
      "turkishTranslation": "Allah'ım, kederden ve hüzünden, acizlikten ve tembellikten, korkaklıktan ve cimrilikten, borç altında ezilmekten ve insanların baskısından Sana sığınırım.",
      "updated": "2025-05-08 19:40:42.478Z"
    },
    {
      "arabicText": "اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.487Z",
      "englishTranslation": "O Allah, purify me from sins and mistakes as a white garment is purified from filth.",
      "germanTranslation": "O Allah, reinige mich von Sünden und Fehlern, wie ein weißes Gewand von Schmutz gereinigt wird.",
      "id": "xq29n4y229a515f",
      "source": "Hadith (Ibn Majah)",
      "transliteration": "Allahumma tahhirnee minadh-dhunubi wal-khataaya kama yunaqqath-thawbul-abyadu minad-danas",
      "turkishTranslation": "Allah'ım, beyaz elbisenin kirden temizlendiği gibi beni günahlardan ve hatalardan temizle.",
      "updated": "2025-05-08 19:40:42.487Z"
    },
     {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ التَّوْبَةَ وَالْمُعَافَاةَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.492Z",
      "englishTranslation": "O Allah, I ask You for repentance, well-being, and safety in this world and the Hereafter.",
      "germanTranslation": "O Allah, ich bitte Dich um Reue, Wohlergehen und Sicherheit in dieser Welt und im Jenseits.",
      "id": "46pns4uv00yqc8l",
      "source": "Hadith (Ibn Majah)",
      "transliteration": "Allahumma inni as'alukat-tawbata wal-mu'aafata wal-'aafiyata fid-dunya wal-akhirah",
      "turkishTranslation": "Allah'ım, Senden tövbe, afiyet ve dünya ile ahirette sağlık diliyorum.",
      "updated": "2025-05-08 19:40:42.492Z"
    },
    {
      "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.495Z",
      "englishTranslation": "Our Lord, grant us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.",
      "germanTranslation": "Unser Herr, gib uns Gutes in dieser Welt und Gutes im Jenseits, und bewahre uns vor der Strafe des Feuers.",
      "id": "d1ir0e61l1j12q5",
      "source": "Quran 2:201",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar",
      "turkishTranslation": "Rabbimiz, bize dünyada iyilik ver, ahirette de iyilik ver ve bizi ateşin azabından koru.",
      "updated": "2025-05-08 19:40:42.495Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.500Z",
      "englishTranslation": "O Allah, You are my Lord, there is no deity but You. You created me, and I am Your servant. I abide by Your covenant and promise as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me, and I confess my sins. So forgive me, for none forgives sins except You.",
      "germanTranslation": "O Allah, Du bist mein Herr, es gibt keinen Gott außer Dir. Du hast mich erschaffen, und ich bin Dein Diener. Ich halte mich an Deinen Bund und Dein Versprechen, so gut ich kann. Ich suche Zuflucht bei Dir vor dem Bösen dessen, was ich getan habe. Ich gestehe Deine Gunst mir gegenüber und bekenne meine Sünden. So vergib mir, denn niemand vergibt die Sünden außer Dir.",
      "id": "u6g43edx8gu2n5g",
      "source": "Hadith (Bukhari)",
      "transliteration": "Allahumma anta Rabbi, la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'oodhu bika min sharri ma sana'tu, aboo'u laka bini'matika 'alayya, wa aboo'u bidhanbee, faghfir lee fa innahu la yaghfirudh-dhunuba illa anta",
      "turkishTranslation": "Allah'ım, Sen benim Rabbimsin, Senden başka ilah yoktur. Beni Sen yarattın ve ben Senin kulunum. Gücüm yettiğince Senin ahdine ve vaadine bağlıyım. Yaptıklarımın kötülüğünden Sana sığınırım. Bana olan nimetini itiraf ediyor, günahlarımı da kabul ediyorum. Beni bağışla, çünkü günahları ancak Sen bağışlarsın.",
      "updated": "2025-05-08 19:40:42.500Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.505Z",
      "englishTranslation": "O Allah, I ask You for all that is good, in this world and the next, what I know of it and what I do not know. And I seek refuge in You from all that is evil, in this world and the next, what I know of it and what I do not know.",
      "germanTranslation": "O Allah, ich bitte Dich um alles Gute, in dieser Welt und im Jenseits, was ich davon weiß und was ich nicht weiß. Und ich suche Zuflucht bei Dir vor allem Bösen, in dieser Welt und im Jenseits, was ich davon weiß und was ich nicht weiß.",
      "id": "6024n7yq5fjp793",
      "source": "Hadith (Ibn Majah)",
      "transliteration": "Allahumma inni as'aluka minal-khayri kullihi 'ajilihi wa ajilihi ma 'alimtu minhu wa ma lam a'lam, wa a'oodhu bika minash-sharri kullihi 'ajilihi wa ajilihi ma 'alimtu minhu wa ma lam a'lam",
      "turkishTranslation": "Allah'ım, Senden her türlü hayrı isterim; dünya ve ahirette, bildiğim ve bilmediğim bütün iyilikleri. Ve her türlü şerden Sana sığınırım; dünya ve ahirette, bildiğim ve bilmediğim bütün kötülüklerden.",
      "updated": "2025-05-08 19:40:42.505Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.508Z",
      "englishTranslation": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
      "germanTranslation": "O Allah, ich bitte Dich um Rechtleitung, Gottesfurcht, Keuschheit und Unabhängigkeit.",
      "id": "43ilrhq6817v2oo",
      "source": "Hadith (Muslim)",
      "transliteration": "Allahumma inni as'alukal-huda wat-tuqa wal-'afaaf wal-ghina",
      "turkishTranslation": "Allah'ım, Senden hidayet, takva, iffet ve zenginlik (gönül zenginliği) diliyorum.",
      "updated": "2025-05-08 19:40:42.508Z"
    },
    {
      "arabicText": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.512Z",
      "englishTranslation": "O Allah, rectify my religion, which is the safeguard of my affairs. Rectify my worldly life, in which is my livelihood. Rectify my Hereafter, in which is my return. Make life an increase for me in every good, and make death a relief for me from every evil.",
      "germanTranslation": "O Allah, verbessere meine Religion, die der Schutz meiner Angelegenheiten ist. Verbessere mein weltliches Leben, in dem mein Lebensunterhalt liegt. Verbessere mein Jenseits, in das ich zurückkehren werde. Mache das Leben für mich zu einer Zunahme an allem Guten, und mache den Tod für mich zu einer Erleichterung von allem Bösen.",
      "id": "9fc7h86hj0k8b0a",
      "source": "Hadith (Muslim)",
      "transliteration": "Allahumma aslih lee deeniyal-ladhi huwa 'ismatu amree, wa aslih lee dunyaya-l-lati feeha ma'ashee, wa aslih lee akhirati-l-lati feeha ma'aadee, waj'alil-hayata ziyadatan lee fee kulli khayr, waj'alil-mawta raahatan lee min kulli sharr",
      "turkishTranslation": "Allah'ım, işlerimin koruyucusu olan dinimi düzelt. Geçim kaynağım olan dünyamı düzelt. Dönüş yerim olan ahiretimi düzelt. Hayatı her hayırda artış vesilesi kıl, ölümü de her şerden kurtuluş vesilesi eyle.",
      "updated": "2025-05-08 19:40:42.512Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.517Z",
      "englishTranslation": "O Allah, I seek refuge in You from the removal of Your blessings, the change in Your protection, the suddenness of Your punishment, and all forms of Your displeasure.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir davor, dass Deine Gaben verschwinden, Dein Schutz sich ändert, Deine Strafe plötzlich kommt und vor allem, was Deinen Zorn erregt.",
      "id": "zp84jld60mj5drh",
      "source": "Hadith (Muslim)",
      "transliteration": "Allahumma inni a'oodhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jamee'i sakhatik",
      "turkishTranslation": "Allah'ım, nimetlerinin yok olmasından, afiyetinin değişmesinden, cezanın ansızın gelmesinden ve bütün gazabından Sana sığınırım.",
      "updated": "2025-05-08 19:40:42.517Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَالْهَرَمِ، وَالْمَأْثَمِ، وَالْمَغْرَمِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.520Z",
      "englishTranslation": "O Allah, I seek refuge in You from laziness, old age, sinfulness, and debt.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor Faulheit, Altersschwäche, Sündhaftigkeit und Schulden.",
      "id": "8v5aolmf5m9f1z7",
      "source": "Hadith (Bukhari)",
      "transliteration": "Allahumma inni a'oodhu bika minal-kasal, wal-haram, wal-ma'tham, wal-maghram",
      "turkishTranslation": "Allah'ım, tembellikten, yaşlılıktan, günahtan ve borçtan Sana sığınırım.",
      "updated": "2025-05-08 19:40:42.520Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ، وَمِنْ قَلْبٍ لاَ يَخْشَعُ، وَمِنْ نَفْسٍ لاَ تَشْبَعُ، وَمِنْ دَعْوَةٍ لاَ يُسْتَجَابُ لَهَا",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.523Z",
      "englishTranslation": "O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear, from a soul that is never satisfied, and from a supplication that is not answered.",
      "germanTranslation": "O Allah, ich suche Zuflucht bei Dir vor nutzlosem Wissen, einem Herzen ohne Ehrfurcht, einer unersättlichen Seele und einem Gebet, das nicht erhört wird.",
      "id": "1g519wyz76hto4y",
      "source": "Hadith (Muslim)",
      "transliteration": "Allahumma inni a'oodhu bika min 'ilmin la yanfa', wa min qalbin la yakhsha', wa min nafsin la tashba', wa min da'watin la yustajabu laha",
      "turkishTranslation": "Allah'ım, faydasız ilimden, huşu duymayan kalpten, doymayan nefisten ve kabul olunmayan duadan Sana sığınırım.",
      "updated": "2025-05-08 19:40:42.523Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ فِتْنَةَ قَوْمٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.526Z",
      "englishTranslation": "O Allah, I ask You to enable me to do good deeds, abandon evil deeds, love the poor, and that You forgive me and have mercy on me. And when You will a trial for a people, take me without being afflicted.",
      "germanTranslation": "O Allah, ich bitte Dich darum, gute Taten zu vollbringen, schlechte Taten zu unterlassen, die Armen zu lieben, und dass Du mir vergibst und Dich meiner erbarmst. Und wenn Du eine Prüfung über ein Volk bringen willst, dann nimm mich zu Dir, ohne dass ich davon betroffen bin.",
      "id": "8rfv8yo25yuu6nn",
      "source": "Hadith (Tirmidhi)",
      "transliteration": "Allahumma inni as'aluka fi'lal-khayrat, wa tarkal-munkarat, wa hubbal-masakeen, wa an taghfira lee wa tarhamanee, wa idha aradta fitnata qawmin fatawaffanee ghayra maftoon",
      "turkishTranslation": "Allah'ım, Senden hayırlı işler yapmayı, kötülükleri terk etmeyi, fakirleri sevmeyi, beni bağışlamanı ve bana merhamet etmeni istiyorum. Bir kavme fitne vermek istediğinde, beni fitneye uğramadan vefat ettir.",
      "updated": "2025-05-08 19:40:42.526Z"
    },
    {
      "arabicText": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
      "category": "Repentance",
      "collectionId": "pbc_1440548899",
      "collectionName": "duas",
      "created": "2025-05-08 19:40:42.530Z",
      "englishTranslation": "O Allah, I ask You for Your pleasure and Paradise, and I seek refuge in You from Your displeasure and the Fire.",
      "germanTranslation": "O Allah, ich bitte Dich um Dein Wohlgefallen und das Paradies, und ich suche Zuflucht bei Dir vor Deinem Zorn und dem Feuer.",
      "id": "i76i992067wo65z",
      "source": "Hadith (Abu Dawud, Tirmidhi)",
      "transliteration": "Allahumma inni as'aluka ridaka wal-jannah, wa a'oodhu bika min sakhatika wan-nar",
      "turkishTranslation": "Allah'ım, Senden rızanı ve cenneti istiyorum. Gazabından ve ateşten Sana sığınıyorum.",
      "updated": "2025-05-08 19:40:42.530Z"
    }
  ]